html.h1.loginPage=Login page for Workshop employees
html.submit.text.login=Login
html.title.loginPage=Internal site login page
html.upNav.upperMenu.aboutMe=About me
html.upNav.upperMenu.designComplaint=To complain of design and make-up
html.upNav.upperMenu.projectInDetail=Project in detail
html.upNav.upperMenu.projectInDetail.submenu.authorizationSecurity=Authorization
html.upNav.upperMenu.projectInDetail.submenu.howItWorks=How it should work
html.upNav.upperMenu.projectInDetail.submenu.authenticationSecurity=Authentication
html.upNav.upperMenu.projectInDetail.title=Project details in a nutshell
html.upNav.upperMenu.projectPurposes=Project purposes
html.upNav.upperMenu.projectTechnogies=Used technologies
html.upNav.upperMenu.underConstruction=What is under construction
html.span.workshopMotto=Keep it simple.
html.div.workshopName=WORKSHOP
html.upNav.upperMenu.projectInDetail.submenu.authenticationSecurity.title=How it checks usernames and passwords
html.upNav.upperMenu.projectInDetail.submenu.authorizationSecurity.title=How it grants access based on Granted Authorities
html.article.index-demo=ww
html.title.indexPage=WORKSHOP MAIN PAGE
html.h1.index-demo=Workshop main demo-page
html.upNav.upperMenu.projectTechnogies.springBoot=Spring Boot
html.upNav.upperMenu.projectTechnogies.springMvc=Spring MVC
html.upNav.upperMenu.projectTechnogies.springSecurity=Spring Security
html.upNav.upperMenu.projectTechnogies.springHateoas=Spring HATEOAS (REST)
html.upNav.upperMenu.projectTechnogies.jpa=JPA (Hibernate)
html.article.purposesPage=Purposes article
html.title.aboutPage=About me
html.title.howItWorksPage=How it works
html.h1.howItWorksPage=How it works in a nutshell
html.article.howItWorksPage=How it works
html.h1.authenticationPage=Authentication flow
html.title.authenticationPage=Authentication
html.article.authenticationPage=<p>Every user request passes through security filters.</p>\
<p>The free access is granted for almost all the pages of external site (except profile and online Order building pages) and the internal site login page.</p>\
<h3>FOR REGISTERED USERS</h3>\
<p>After User's successful login the application issues a <a href="https://jwt.io/">JWT token</a> and sends it in a response as the cookie "workshopUserAuthentication" with that JWT-token which will be evaluated in every further reques.</p>\
<h3>REGISTRATION PROCESS</h3>\
<p>The user data are evaluated beforehand on page (to check if the password strength correct, if the server doesn't have the same registered email etc), and then is being validated also on the server.\
<br>\
If all the data are correct the special disposable key-link will be sent to the registration email to confirm it. And only after the confirmation the given account will be permanently saved. <i>In the demo-mode the key-link is just displayed on page to click on.</i>\
</p>
html.title.authorizationPage=Authorization
html.h1.authorizationPage=Authorization process flow
html.article.authorizationPage=<ul>\
    <li>\
    Every application Entity has its own type (<b>WorkshopEntityType</b>) which just corresponds its name: <b>Order</b>, <b>Task</b>, <b>User</b> etc.\
    </li>\
    <li>\
    <p>The permissions (<b>AuthorityPermissions</b>) for accessing those Entities are based on HTTP-protocols: <b>GET</b> (Read), <b>PUT</b> (Write), <b>POST</b> (Create), <b>DELETE</b> (Delete).</p>\
    <p>Every created permission includes the access type and Entities set for this specific access type. E.g., AuthorityPermission "PUT (Order, Classifier)" allows modifiyng Orders and Classifiers entities.</p>\
    </li>\
    <li>\
    <p>Every permissions set are grouped into separate Permissions (<b>InternalAuthorities</b> for Employees and <b>ExternalAuthorities</b> for external Users).</p>\
    <p>For instanse, <b>InternalAuthority</b> "<b>HR_WRITE</b>" will include the previously created <b>"PUT (Order, Classifier)"</b> and <b>"GET (Order, Classifier, User, Task)"</b> permissions which will allow the owner of that <b>InternalAuthority</b> modifiyng Orders and Classifiers, and also reading the particular Orders and Users.</p>\
    </li>\
    <li>\
    <p>Eventually <b>InternalAuthorities</b> is spreaded among employees (<b>Position</b>)s and the <b>Employee</b>s have the abilities to save, modify and read the application Entities according to those <b>InternalAuthorities</b>.</p>\
    <p><b>ExternalAuthorities</b> in their turn are spreaded by similar sets among external Users.</p>\
    </li>\
</ul>
html.article.underConstructionPage=Under construction description
html.h1.underConstructionPage=What is under construction
html.title.underConstructionPage=Under construction
html.title.tecnologiesPage=Technologies used
html.h1.technologiesPage=Technologies used in the project
html.article.technologies-demo=Technologies used in the project
html.upNav.upperMenu.projectTechnogies.sqlH2=SQL (H2 database)
html.article.designComplaint=<p>I am not good at drawing. Hence the design you are looking at is not so sofisticated\
	<br>\
	So make-up, styling, pixel-hunting etc are boring enough and not so interesting.\
	 <br>\
	 At the moment the project contains the common HTML + separated CSS styles for the every page. And all of those are based on a single hand-made template.\
	 <br>\
	 <p>Your complaint is accepted )))</P\
	 </p>
html.a.text.close=Close
html.upNav.upperMenu.projectTechnogies.etc=Hibernate Validation, Jackson JSON, Lombok ...
html.upNav.upperMenu.projectTechnogies.test=JUnit / Mockito
html.a.text.shutdown=X
html.button.title.shutdown=Close the Application
email.simpleMessage.subject.orderFinished(1)=Your Order\u2116 {0} is ready
email.simpleMessage.text.orderFinished(2)=We are happy to inform you that your Order\u2116 {0} is ready and you can get it at any time! \n {1}
html.a.href.contacts.gitHub=https://github.com/BAXMYPKA
html.a.text.gitHubPfofile=GItHub profile:
html.h4.contacts=Contacts:
html.article.aboutMe=This is all about me.
html.h1.aboutMe=About me
html.upNav.upperMenu.projectTechnogies.thymeleafHtmlCss=Thymeleaf / HTML/CSS
html.section.login.main=<p>\u042D\u0442\u043E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0432\u043E \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0439 \u0440\u0430\u0437\u0434\u0435\u043B \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432.</p>\
	<p>\u041B\u043E\u0433\u0438\u043D - \u044D\u0442\u043E \u043F\u043E\u0447\u0442\u0430, \u0430 \u043F\u0430\u0440\u043E\u043B\u0438 \u0443 \u0432\u0441\u0435\u0445, \u0434\u043B\u044F \u0443\u043F\u0440\u043E\u0449\u0435\u043D\u0438\u044F, "12345". \u0421\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u0438\u0434\u0435\u0442\u044C \u0441\u043F\u0440\u0430\u0432\u0430.</p>\
	<p>\u0423 \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u0430 \u0441\u0432\u043E\u044F \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C \u0438 \u043A\u0430\u0436\u0434\u0430\u044F \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C \u0438\u043C\u0435\u0435\u0442 \u0441\u0432\u043E\u0438 \u043F\u0440\u0430\u0432\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u0430.</p>\
	<p>\u0421\u0430\u043C\u044B\u0439 \u043F\u043E\u043B\u043D\u044B\u0439 \u0434\u043E\u0441\u0442\u0443\u043F \u043A\u043E \u0432\u0441\u0435\u043C \u0440\u0430\u0437\u0434\u0435\u043B\u0430\u043C \u0441\u043E \u0432\u0441\u0435\u043C\u0438 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F\u043C\u0438 \u0438\u043C\u0435\u0435\u0442 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C "admin@workshop.pro" \u0441\u043E \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u043C \u043F\u0430\u0440\u043E\u043B\u0435\u043C "12345".</p>\
	<p>\u042F\u0437\u044B\u043A\u043E\u0432 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u0432\u0430 - \u0420\u0443\u0441\u0441\u043A\u0438\u0439 \u0438 \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 (\u043F\u043E-\u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E). \u042F\u0437\u044B\u043A \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u043F\u043E\u0434\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F	\u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0438\u0437 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u0430 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 "Accept-Language", \u043F\u043E\u0441\u043B\u0435 \u0441\u043C\u0435\u043D\u044B \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u0443\u043A\u0443.</p>
html.h1.internal.login=Internal login for Employees
html.thead.internal.login.predefinedEmployees=Predefined Employees list
properties.fullName=Full name
properties.email=Email
properties.position=Position
properties.department=Department
properties.language=Language
html.a.text.index-demo=Demo main page
html.a.title.index-demo=The main demo-page with project's details
html.a.text.index=Main page
html.a.title.index=Workshop public main page for the Users
html.a.text.internalPage=Internal page
html.a.title.internalPage=Workshop internal page for employees
html.h1.index=Workshop Bicycles main page
html.article.index=Main page text
html.a.index.loginRegistration=Login / Registration
html.article.login=<p>\
\u0418\u043C\u044F \u043B\u043E\u0433\u0438\u043D\u0430 - \u043F\u043E\u0447\u0442\u043E\u0432\u044B\u0439 \u0430\u0434\u0440\u0435\u0441.\
<br>\
\u041F\u043E\u0441\u043B\u0435 \u0432\u0445\u043E\u0434\u0430 \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0441\u0432\u043E\u0439 \u043F\u0440\u043E\u0444\u0438\u043B\u044C, \u0441\u0432\u043E\u0438 \u0437\u0430\u043A\u0430\u0437\u044B \u0438 \u0441\u043E\u0431\u0440\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437 \u043E\u043D\u043B\u0430\u0439\u043D.\
<br><br>\
\u041D\u0438\u0436\u0435 \u0435\u0441\u0442\u044C \u0441\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439, \u043F\u0430\u0440\u043E\u043B\u044C \u0434\u043B\u044F \u0432\u0441\u0435\u0445 "12345".\
<br>\
\u041C\u043E\u0436\u043D\u043E \u0432\u043E\u0439\u0442\u0438 \u043F\u043E\u0434 \u043B\u044E\u0431\u044B\u043C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u043C \u0438 \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0435\u0433\u043E \u0434\u0430\u043D\u043D\u044B\u0435, \u0437\u0430\u043A\u0430\u0437\u044B \u0438 \u0442.\u043F.\
<br><br>\
\u041F\u0440\u043E\u0446\u0435\u0441\u0441 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043E\u043F\u0438\u0441\u0430\u043D \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043F\u043E \u043A\u043B\u0438\u043A\u0443 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0439 \u043A\u043D\u043E\u043F\u043A\u0438.\
<br><br>\
<i>\
\u041F\u043E\u043B\u044F \u0432\u0432\u043E\u0434\u0430 \u0438\u043D\u0442\u0435\u0440\u0430\u043A\u0442\u0438\u0432\u043D\u044B. \u0412\u0432\u043E\u0434 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0442\u044C \u043D\u0430\u043B\u0438\u0447\u0438\u0435 \u0442\u0430\u043A\u043E\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0432 \u0431\u0430\u0437\u0435 \u043F\u043E\u0441\u043B\u0435 \u0432\u0432\u043E\u0434\u0430 \u0430\u0434\u0440\u0435\u0441\u0430, \u0430 \u043F\u0430\u0440\u043E\u043B\u044C \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0442\u044C\u0441\u044F \u043D\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435 \u043C\u0438\u043D\u0438\u043C\u0443\u043C 5 \u0437\u043D\u0430\u043A\u043E\u0432.\
</i>\
</p>
properties.enabled=Enabled
html.thead.external.login.predefinedUsers=The list of predefined Users
html.a.text.services=Services list
html.a.title.services=Services list
html.h1.services=Our services list
html.submit.text.registrationSuggest=You have no profile? Register!
html.button.title.registrationProcessDescription=The screen with detailed regisration process description.
html.a.text.howToGetToUs=How to get to us
html.a.text.contacts=Contacts
html.a.text.address=Address
html.a.text.ourWorkshop=Our workshop
html.a.text.workshopStuff=Our stuff photo gallery
html.div.workshopBicyclesName=Workshop bicycles
html.input.login.loginUsername=sebastian-pidorin@mail.pro
html.input.password.loginPassword=12345
html.upNav.upperMenu.projectTechnogies.javaScript=JavaScript
html.a.text.logout=Logout
html.a.title.workshop=Our Workshop
html.h1.workshop=Our Bicycles Workshop
html.a.title.workshopStuff=Our Bicycles Workshop Stuff
html.a.text.buildOrder=Build online Order
html.a.title.buildOrder=To build your own online Order
html.a.title.profile=User profile
properties.created=Creation date
html.h1.profile=User profile
properties.firstName=Name
properties.lastName=Surname
properties.birthday=Date of birth
html.thead.profile.tableName=Profile details
properties.phone=Phone
html.submit.text.saveChanges=Save changes
html.button.title.deletePhone=Delete phone
properties.phoneName=Phone name
properties.phoneNumber=Phone number
html.button.title.addPhone=Add phone
properties.phoneNotice=<br><i>Add a new Phone by the green check to the right</i>
html.h1.orders=Your Orders
html.a.title.userOrders=Your Orders
html.thead.profile.orders.ordersList=Your Orders list
properties.id=ID
properties.finished=Finished
properties.description=Description
properties.overallPrice=Overall pice
html.a.title.userOrder=Order page
html.thead.profile.orderDetails=Order details
properties.messageToUser=Message to User
properties.tasks=Included Tasks
properties.unroll=Unroll
html.thead.profile.tasks=Tasks
properties.price=Price
properties.name=Name
properties.deadline=Dealine
properties.appointedTo=Accountable person
html.h1.buildOrder=Build your own online Order
html.a.title.buildOrderOnline=Build online Order
properties.photo=Photo
properties.savePhoto=Save photo
properties.deletePhoto=Delete photo
html.button.title.deletePhoto=Delete photo
properties.uderConstruction=Under construction
html.a.title.registration=Registration
html.h1.registration=New User registration
html.a.index.registration=Registration
html.a.index.login=Login
html.input.placeholder.enterYourEmail=Enter your email here
html.input.placeholder.enterYourPassword=Password (minimum 5 symbols)
html.submit.text.registration=Create account!
html.input.placeholder.confirmYourPassword=Confirm new password
html.span.text.selectYourLanguage=Preferred language
properties.details=Details
html.span.text.redAsteriskFields=Asterisk-marked fields are should be filled up
html.a.title.login=Login page
email.mimeMessage.subject.registrationConfirmation=Registration confirmation on Workshop.pro
email.mimeMessage.text.registrationConfirmation(2)=<p>\
\u0412\u044B \u0442\u043E\u043B\u044C\u043A\u043E \u0447\u0442\u043E \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u043B\u0438\u0441\u044C \u043D\u0430 \u043D\u0430\u0448\u0435\u043C \u0441\u0430\u0439\u0442\u0435 {0}.</p>\
<p>\
\u0414\u043B\u044F \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043F\u0440\u043E\u0439\u0434\u0438\u0442\u0435, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043F\u043E \u0441\u044B\u044B\u043B\u043A\u0435: {1}, \u043F\u043E\u0441\u043B\u0435 \u0447\u0435\u0433\u043E \u0432\u0430\u043C \u0431\u0443\u0434\u0443\u0442 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u043E\u043F\u0446\u0438\u0438.\
</p>\
<p>\
\u0415\u0441\u043B\u0438 \u044D\u0442\u043E \u0431\u044B\u043B\u0438 \u043D\u0435 \u0432\u044B, \u043F\u0440\u043E\u0441\u0442\u043E \u0443\u0434\u0430\u043B\u0438\u0442\u0435 \u044D\u0442\u043E \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435.\
</p>\
<p>\
<i>\
\u041F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043D\u0435 \u043E\u0442\u0432\u0435\u0447\u0430\u0439\u0442\u0435 \u043D\u0430 \u044D\u0442\u043E \u043F\u0438\u0441\u044C\u043C\u043E, \u043E\u043D\u043E \u043D\u043E\u0441\u0438\u0442 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0442\u0438\u0432\u043D\u044B\u0439 \u0445\u0430\u0440\u0430\u043A\u0442\u0435\u0440.\
</i>\
</p>
html.a.text.repeatedActivationLink=To get a repeated account activation link.
html.article.registration.repeatedAccountActivationLinkRequest=Enter the login (email) you used while registering for the first time. We will send the repeated account activation link onto this email.
html.article.registration.repeatedAccountActivationLinkRequestDemo=<p>\
Enter the login (email) you used while registering for the first time. We will send the repeated account activation link onto this email.\
</p>\
<p>\
Input fields are interactive. While input you will be informed if an email exist and if it possible to obtain an activation link for non-active profile.\
</p>
html.submit.text.reactivation=Get the link
html.a.title.repeatedAccountActivation=If you had been registered but haven't received the activation link yet.
html.input.placeholder.enterRegistrationEmail=Email for activation
html.submit.text.resetPassword=Reset password
html.button.title.resetPasswordProcessDescription=Request the reset password procedure
html.a.title.passwordReset=Reset password page
html.submit.title.passwordResetDescription=Get the password reset link by email
html.input.placeholder.enterNewPassword=Enter new password
html.article.resetPasswordLoggedUsersDemo=\u0414\u0430\u043D\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u043E\u0442\u043B\u0438\u0447\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0432\u043E\u0448\u0435\u0434\u0448\u0438\u0445 \u0438 \u043D\u0435 \u0432\u043E\u0448\u0435\u0434\u0448\u0438\u0445 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439. \u0414\u043B\u044F \u043F\u0435\u0440\u0432\u044B\u0445 \u044D\u0442\u043E \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u0430\u044F (\u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0443\u043F\u0440\u043E\u0449\u0435\u043D\u043D\u0430\u044F) \u0444\u043E\u0440\u043C\u0430 \u0441\u0431\u0440\u043E\u0441\u0430, \u0434\u043B\u044F \u0432\u0442\u043E\u0440\u044B\u0445 - \u043E\u0442\u043F\u0440\u0430\u0432\u043A\u0430 \u043D\u0430 \u043F\u043E\u0447\u0442\u0443 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F \u0441\u043E \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0439 \u0441\u0441\u044B\u043B\u043A\u043E\u0439 \u0434\u043B\u044F \u0441\u0431\u0440\u043E\u0441\u0430.
