html.h1.loginPage=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432 Workshop
html.submit.login=\u0412\u043E\u0439\u0442\u0438
html.title.loginPage=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.upNav.upperMenu.aboutMe=\u041E\u0431\u043E \u043C\u043D\u0435
html.upNav.upperMenu.designComplaint=\u041F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u0434\u0438\u0437\u0430\u0439\u043D \u0438 \u0432\u0435\u0440\u0441\u0442\u043A\u0443
html.upNav.upperMenu.projectInDetail=\u0414\u0435\u0442\u0430\u043B\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.upNav.upperMenu.projectInDetail.submenu.authorizationSecurity=\u0410\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u044F
html.upNav.upperMenu.projectInDetail.submenu.howItWorks=\u041A\u0430\u043A \u044D\u0442\u043E \u0434\u043E\u043B\u0436\u043D\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C
html.upNav.upperMenu.projectInDetail.submenu.authenticationSecurity=\u0410\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F
html.upNav.upperMenu.projectInDetail.title=\u041A\u0430\u043A \u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u0432\u043A\u0440\u0430\u0442\u0446\u0435
html.upNav.upperMenu.projectPurposes=\u0426\u0435\u043B\u044C \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.upNav.upperMenu.projectTechnogies=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.upNav.upperMenu.underConstruction=\u0427\u0442\u043E \u0435\u0449\u0435 \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043E
html.div.workshopName=WORKSHOP
html.upNav.upperMenu.projectInDetail.submenu.authenticationSecurity.title=\u041A\u0430\u043A \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0435\u0442 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 \u0438 \u0438\u0445 \u043F\u0430\u0440\u043E\u043B\u0438
html.upNav.upperMenu.projectInDetail.submenu.authorizationSecurity.title=\u041A\u0430\u043A \u0440\u0430\u0437\u0434\u0430\u044E\u0442\u0441\u044F \u043F\u0440\u0430\u0432\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u043A \u0442\u0435\u043C \u0438\u043B\u0438 \u0438\u043D\u044B\u043C \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044F\u043C
html.article.index-demo=<p>\u0412\u0430\u0441 \u043F\u0440\u0438\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0443\u0441\u043B\u043E\u0432\u043D\u043E-\u0442\u0435\u043E\u0440\u0435\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u0438\u043D\u0442\u0435\u0440\u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u044F Workshop \u043D\u0430 \u0441\u0432\u043E\u0435\u0439 \u0433\u043B\u0430\u0432\u043D\u043E\u0439 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435.</p>\
<p>\u0422\u0435\u043E\u0440\u0435\u0442\u0438\u0447\u0435\u0441\u043A\u0438, \u043C\u044B \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u043C \u043B\u044E\u0431\u043E\u0439 \u0441\u043F\u0435\u043A\u0442\u0440 \u0443\u0441\u043B\u0443\u0433. \u0421\u0435\u0439\u0447\u0430\u0441 \u043C\u044B \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u043C \u0432\u0430\u043C \u0422\u041E, \u0440\u0435\u043C\u043E\u043D\u0442 \u0438 \u043B\u044E\u0431\u043E\u0435 \u043E\u0431\u0441\u043B\u0443\u0436\u0438\u0432\u0430\u043D\u0438\u0435 \u0432\u0430\u0448\u0435\u0433\u043E \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u0430.\
<p>\u0415\u0441\u043B\u0438 \u0432\u044B \u043B\u0438\u0447\u043D\u043E \u043F\u043E\u0441\u0435\u0442\u0438\u043B\u0438 \u043D\u0430\u0448 \u043E\u0444\u0438\u0441, \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043E\u0444\u043E\u0440\u043C\u0438\u0442 \u0434\u043B\u044F \u0432\u0430\u0441 \u0437\u0430\u043A\u0430\u0437 \u0438 \u0432\u044B\u0434\u0430\u0441\u0442 \u0432\u0430\u043C \u0435\u0433\u043E \u043D\u043E\u043C\u0435\u0440, \u0430 \u043D\u0430 \u0441\u0430\u0439\u0442\u0435, \u0431\u0435\u0437 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438, \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043E\u0442\u0441\u043B\u0435\u0434\u0438\u0442\u044C \u0435\u0433\u043E \u0441\u0442\u0435\u043F\u0435\u043D\u044C \u0433\u043E\u0442\u043E\u0432\u043D\u043E\u0441\u0442\u0438.</p>\
<p>\u041F\u0440\u0438 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u0436\u0435 \u043D\u0430 \u0441\u0430\u0439\u0442\u0435 \u0432\u044B \u0441\u043C\u043E\u0436\u0435\u0442\u0435 \u0441\u0430\u043C\u0438 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437\u044B, \u0432\u044B\u0431\u0438\u0440\u0430\u044F \u0438\u0437 \u043F\u0440\u0430\u0439\u0441\u0430 \u043D\u0443\u0436\u043D\u044B\u0435 \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u0443\u0441\u043B\u0443\u0433\u0438, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u0438\u0432\u0435\u0437\u0442\u0438 \u043A \u043D\u0430\u043C \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434 \u043F\u043E\u0437\u0436\u0435.</p>\
\
<p>\u042F\u0437\u044B\u043A\u043E\u0432 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u0432\u0430 - \u0420\u0443\u0441\u0441\u043A\u0438\u0439 \u0438 \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 (\u043C\u044B \u0436\u0435\u0436 \u0438\u043D\u0442\u0435\u0440\u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u044F!). \u042F\u0437\u044B\u043A \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u043F\u043E\u0434\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0438\u0437 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u0430 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 "Accept-Language", \u043F\u043E\u0441\u043B\u0435 \u0441\u043C\u0435\u043D\u044B \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u0443\u043A\u0443 \u0438 \u0432\u043E\u043E\u0431\u0449\u0435 \u0432\u0441\u0435 \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u043D\u0430 \u0434\u0440\u0443\u0433\u043E\u043C \u044F\u0437\u044B\u043A\u0435. \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 \u043F\u043E-\u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E.</p>\
\
<p>\u0412\u0435\u0441\u044C \u043F\u0440\u043E\u0435\u043A\u0442 \u0434\u0435\u043B\u0438\u0442\u0441\u044F \u043D\u0430 \u0434\u0432\u0430 \u0434\u043E\u043C\u0435\u043D\u0430 - \u0432\u043D\u0435\u0448\u043D\u0438\u0439 (External) \u0434\u043B\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 \u0438 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0439 (Internal) \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432. \u0423 \u0412\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0433\u043E \u043F\u043E\u043A\u0430 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D \u0442\u043E\u043B\u044C\u043A\u043E \u0431\u044D\u043A\u0435\u043D\u0434, \u0430 \u0412\u043D\u0435\u0448\u043D\u0438\u0439 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0435.</p>\
\
<p>\u041F\u0440\u0438 \u0437\u0430\u043F\u0443\u0441\u043A\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0441\u0435\u0440\u0432\u0435\u0440 \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u043F\u0430\u043C\u044F\u0442\u0438, \u043A\u0443\u0434\u0430 \u0437\u0430\u043D\u043E\u0441\u044F\u0442\u0441\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0435 \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 (\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438, \u0421\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u0438, \u0417\u0430\u043A\u0430\u0437\u044B \u0438 \u0442.\u043F.). \u041F\u043E\u0441\u043B\u0435 \u0432\u044B\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F \u0432\u0441\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u0440\u043E\u043F\u0430\u0434\u0430\u044E\u0442.</p>
html.title.indexPage=\u0413\u041B\u0410\u0412\u041D\u0410\u042F \u0421\u0422\u0420\u0410\u041D\u0418\u0426\u0410 WORKSHOP
html.h1.index-demo=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0434\u0435\u043C\u043E-\u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 Workshop
html.upNav.upperMenu.projectTechnogies.springBoot=Spring Boot
html.upNav.upperMenu.projectTechnogies.springMvc=Spring MVC
html.upNav.upperMenu.projectTechnogies.springSecurity=Spring Security
html.upNav.upperMenu.projectTechnogies.springHateoas=Spring HATEOAS (REST)
html.upNav.upperMenu.projectTechnogies.jpa=JPA (Hibernate)
html.article.purposesPage=<p>\u041F\u043E\u043F\u0440\u043E\u0431\u043E\u0432\u0430\u043B \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u044C, \u043A\u0430\u043A \u043C\u043E\u0433\u043B\u0430 \u0431\u044B \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u0430\u044F \u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u0430\u044F, \u043A \u043F\u0440\u0438\u043C\u0435\u0440\u0443, \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u043D\u0430\u044F, - \u043C\u0435\u043B\u043A\u0430\u044F \u0438\u043B\u0438\
	\u0441\u0440\u0435\u0434\u043D\u044F\u044F, - \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u044E\u0449\u0430\u044F \u0437\u0430\u043A\u0430\u0437\u044B \u043F\u043E \u043F\u0440\u0430\u0439\u0441\u0443 \u043D\u0430 \u0441\u0432\u043E\u0438 \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0435 \u0440\u0430\u0431\u043E\u0442\u044B, \u0433\u0434\u0435 \u043D\u0430\u0431\u043E\u0440 \u0438\u0437 \u0442\u0430\u043A\u0438\u0445 \u0440\u0430\u0431\u043E\u0442 \u043E\u0431\u044A\u0435\u0434\u0438\u043D\u044F\u0435\u0442\u0441\u044F \u0432 \u0437\u0430\u043A\u0430\u0437, \u0430\
	\u043D\u043E\u043C\u0435\u0440 \u0437\u0430\u043A\u0430\u0437\u0430 \u0432\u044B\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F \u043A\u043B\u0438\u0435\u043D\u0442\u0443 \u043D\u0430 \u043D\u043E\u043C\u0435\u0440 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0430 \u0438\u043B\u0438 \u043F\u043E\u0447\u0442\u0443. \u0414\u0430\u043B\u0435\u0435 \u043D\u0430 \u0441\u0430\u0439\u0442\u0435 \u043F\u043E \u043D\u043E\u043C\u0435\u0440\u0443 \u0437\u0430\u043A\u0430\u0437\u0430 \u043A\u043B\u0438\u0435\u043D\u0442\u044B \u043C\u043E\u0433\u0443\u0442 \u043E\u0442\u0441\u043B\u0435\u0434\u0438\u0442\u044C\
	 \u0441\u0442\u0435\u043F\u0435\u043D\u044C \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F.</p>\
	<p>\u0427\u0442\u043E\u0431\u044B \u043D\u0435 \u0434\u0435\u043B\u0430\u0442\u044C \u043C\u043E\u043D\u043E\u043B\u0438\u0442\u043D\u043E\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u043E\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u043D\u043E \u0432 \u0432\u0438\u0434\u0435 \u043E\u0442\u0435\u043B\u044C\u043D\u044B\u0445 Maven-\u043C\u043E\u0434\u0443\u043B\u0435\u0439, \u043A\u0430\u0436\u0434\u044B\u0439 \u0438\u0437 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043E\u0442\u0432\u0435\u0447\u0430\u0435\u0442 \u0437\u0430\
	\u0441\u0432\u043E\u044E \u0437\u0430\u0434\u0430\u0447\u0443.\
	<br>\
	\u0410 \u0432\u0441\u044F \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u044F\u044F \u0447\u0430\u0441\u0442\u044C \u043E\u0431\u0449\u0430\u0435\u0442\u0441\u044F \u0441 \u0432\u0435\u0431-\u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u043E\u043C \u0447\u0435\u0440\u0435\u0437 REST.</p>\
	<p>\u0418\u0442\u043E\u0433\u043E, \u043F\u0440\u043E\u0441\u0442\u0430\u044F \u0438 \u043E\u0447\u0435\u0432\u0438\u0434\u043D\u0430\u044F \u0446\u0435\u043B\u044C: \u043F\u043E\u0449\u0443\u043F\u0430\u0442\u044C \u0432\u0441\u0435 \u044D\u0442\u043E \u0440\u0443\u043A\u0430\u043C\u0438 \u0438 \u043C\u043E\u0437\u0433\u043E\u043C.</p>
html.title.aboutPage=\u041E\u0431\u043E \u043C\u043D\u0435
html.title.howItWorksPage=\u041A\u0430\u043A \u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442
html.h1.howItWorksPage=\u041A\u0430\u043A \u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442. \u0412\u043A\u0440\u0430\u0442\u0446\u0435.
html.article.howItWorksPage=<p><i>\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043F\u043E\u043A\u0430 \u043D\u0435 \u0441\u043B\u0438\u0448\u043A\u043E\u043C \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E, \u0442.\u043A. \u0434\u043E\u043B\u0436\u043D\u043E \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u0442\u044C\u0441\u044F \u0447\u0435\u0440\u0435\u0437 JavaScript \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043F\u043E\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442 \u0432\u0441\u0435 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438,\
\u043D\u043E \u043F\u043E\u043B\u043D\u043E\u0441\u0442\u044C\u044E \u0441\u043F\u043E\u0441\u043E\u0431\u043D\u043E \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C REST-\u0437\u0430\u043F\u0440\u043E\u0441\u044B \u0432\u0441\u0435\u0445 \u043E\u0431\u044A\u044F\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u0432\u0438\u0434\u043E\u0432 \u0434\u043B\u044F \u0432\u0441\u0435\u0445 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0435\u0439.</i></p>\
\
<h4>\u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C, \u0443 \u043D\u0430\u0441 \u0432\u0435\u043B\u043E\u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u0430\u044F, \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u044E\u0449\u0430\u044F \u0443\u0441\u043B\u0443\u0433\u0438 \u043F\u043E \u0440\u0435\u043C\u043E\u043D\u0442\u0443 \u0438 \u043E\u0431\u0441\u043B\u0443\u0436\u0438\u0432\u0430\u043D\u0438\u044E \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u043E\u0432.</h4>\
\
<ol>\
<li>Classifiers:</li>\
<p>\u0418\u0437 \u0441\u043F\u0438\u0441\u043A\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0445 \u041A\u043B\u0430\u0441\u0441\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u0432 (Classifiers) \u0441 \u0444\u0438\u043A\u0441\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u0446\u0435\u043D\u043E\u0439 \u0432\u044B\u0431\u0438\u0440\u0430\u0435\u0442\u0441\u044F \u043D\u0430\u0431\u043E\u0440 \u0443\u0441\u043B\u0443\u0433.\
<br>\
\u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0437\u0430\u0434\u043D\u0435\u0435 \u043A\u043E\u043B\u0435\u0441\u043E \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u043F\u0440\u043E\u0442\u044F\u0436\u043A\u0438 \u0441\u043F\u0438\u0446, \u0437\u0430\u043C\u0435\u043D\u044B \u044D\u043A\u0441\u0446\u0435\u043D\u0442\u0440\u0438\u043A\u0430 \u0438 \u0437\u0430\u043A\u0440\u0430\u0441\u043A\u0443 \u0446\u0430\u0440\u0430\u043F\u0438\u043D\u044B. \u041F\u0440\u043E\u0442\u044F\u0436\u043A\u0430 \u0438 \u044D\u043A\u0441\u0446\u0435\u043D\u0442\u0440\u0438\u043A \u043A\u0430\u043A \u0443\u0441\u043B\u0443\u0433\u0438 \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044E\u0442 \u0432 \u043F\u0443\u0431\u043B\u0438\u0447\u043D\u043E\u043C \u043F\u0440\u0430\u0439\u0441\u0435, \u0430 \u0437\u0430\u043A\u0440\u0430\u0441\u043A\u0443 \u0446\u0430\u043F\u0430\u043F\u0438\u043D\u044B \u043C\u043E\u0436\u043D\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0431\u0435\u0441\u043F\u043B\u0430\u0442\u043D\u043E \u0432 \u043F\u043E\u0434\u0430\u0440\u043E\u043A: \u0441\u043E\u0437\u0434\u0430\u0435\u043C \u043A\u0430\u0441\u0442\u043E\u043C\u043D\u0443\u044E \u0443\u0441\u043B\u0443\u0433\u0443 \u0441 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435\u043C \u0438 \u043D\u0443\u043B\u0435\u0432\u043E\u0439 \u0446\u0435\u043D\u043E\u0439.\
</p>\
<li>Tasks:</li>\
 <p>\u0417\u0430\u0434\u0430\u0447\u0430 \u0441\u0443\u043C\u043C\u0438\u0440\u0443\u0435\u0442 \u0432\u0441\u044E \u0441\u0442\u043E\u0438\u043C\u043E\u0441\u0442\u044C \u0443\u0441\u043B\u0443\u0433 \u0438 \u0436\u0435\u043B\u0430\u0435\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u043E\u043A\u043E\u043D\u0447\u0430\u043D\u0438\u044F \u0440\u0430\u0431\u043E\u0442. \u041F\u043E\u0441\u043B\u0435 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u0437\u0430\u0434\u0430\u0447\u0438 \u043C\u043E\u0436\u043D\u043E \u0441\u0440\u0430\u0437\u0443 \u043D\u0430\u0437\u043D\u0430\u0447\u0438\u0442\u044C \u043D\u0430 \u043D\u0435\u0435 \u0438\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044F (Employee) \u0438\u043B\u0438 \u043E\u043D \u0441\u0430\u043C \u0432 \u0431\u0443\u0434\u0443\u0449\u0435\u043C \u043C\u043E\u0436\u0435\u0442 \u043D\u0430\u0437\u043D\u0430\u0447\u0438\u0442\u044C \u0435\u0435 \u043D\u0430 \u0441\u0435\u0431\u044F \u0441\u0430\u043C.\
</p>\
<li>Orders:</li>\
<p>\u0421\u0443\u043C\u043C\u0438\u0440\u0443\u044E\u0449\u0438\u0435 \u0437\u0430\u043A\u0430\u0437\u044B, \u0430\u0433\u0440\u0435\u0433\u0438\u0440\u0443\u044E\u0449\u0438\u0435 \u0432 \u0441\u0435\u0431\u044F \u0432\u0441\u0435 \u0417\u0430\u0434\u0430\u0447\u0438, \u0432\u0441\u0435 \u041A\u043B\u0430\u0441\u0441\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B \u0438 \u0441\u0443\u043C\u043C\u0443 \u0438\u0445 \u0446\u0435\u043D, \u0434\u0430\u043D\u043D\u044B\u0435 \u043A\u043B\u0438\u0435\u043D\u0442\u0430, \u0434\u0430\u0442\u0443 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F, \u043F\u0440\u0435\u0434\u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u044C\u043D\u0443\u044E \u0434\u0430\u0442\u0443 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0438 \u0442.\u043F. \u0421 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435\u043C \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0439 \u0417\u0430\u0434\u0430\u0447\u0438 \u0417\u0430\u043A\u0430\u0437 \u0441\u0438\u0433\u043D\u0430\u043B\u0438\u0437\u0438\u0440\u0443\u0435\u0442 \u043E \u0441\u0432\u043E\u0435\u043C \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0438 \u043A\u043B\u0438\u0435\u043D\u0442\u0443 \u043F\u043E \u043F\u043E\u0447\u0442\u0435 \u0438\u043B\u0438 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0443.\
 </p>\
<li>Users:</li>\
<p>\u0414\u043B\u044F \u043A\u043E\u043D\u0442\u0430\u043A\u0442\u0430 \u0441 \u043A\u043B\u0438\u0435\u043D\u0442\u043E\u043C \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u0437\u0430\u043D\u043E\u0441\u044F\u0442\u0441\u044F \u043B\u0438\u0431\u043E email, \u043B\u0438\u0431\u043E \u0442\u0435\u043B\u0435\u0444\u043E\u043D \u043A\u043B\u0438\u0435\u043D\u0442\u0430 (User).</p>\
<p>\u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0418\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C (Employee) \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u044E\u044E \u0417\u0430\u0434\u0430\u0447\u0443 \u0438\u043B\u0438 \u0432 \u0417\u0430\u043A\u0430\u0437\u0435 \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u043E \u043F\u043E\u043B\u0435 "finished", \u043A\u043B\u0438\u0435\u043D\u0442\u0443 \u0432\u044B\u0441\u044B\u043B\u0430\u0435\u0442\u0441\u044F email \u0438\u043B\u0438 \u0421\u041C\u0421 \u043D\u0430 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0439 \u0442\u0435\u043B\u0435\u0444\u043E\u043D.\
<br>\
\u0412 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0437\u0430\u043A\u0430\u0437\u0430 \u041A\u043B\u0438\u0435\u043D\u0442 \u043C\u043E\u0436\u0435\u0442 \u043E\u0442\u0441\u043B\u0435\u0436\u0438\u0432\u0430\u0442\u044C \u0435\u0433\u043E \u043D\u0430 \u0441\u0430\u0439\u0442\u0435 \u043F\u043E \u0432\u044B\u0434\u0430\u043D\u043D\u043E\u043C\u0443 ID.</p>\
<p><i>\u0422\u0430\u043A\u0436\u0435 \u0432\u043D\u0443\u0442\u0440\u0438 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044F \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0439 \u043A\u0443\u0445\u043D\u0438, \u043A\u0430\u043A \u0442\u043E, \u0414\u0435\u043F\u0430\u0440\u0442\u0430\u043C\u0435\u043D\u0442\u044B, \u041E\u0442\u0434\u0435\u043B\u044B, \u0414\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u0438 \u0438 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432 \u041E\u0442\u0434\u0435\u043B\u0430 \u041A\u0430\u0434\u0440\u043E\u0432 (HR) \u043F\u043E \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044E \u043F\u0435\u0440\u0441\u043E\u043D\u0430\u043B\u043E\u043C.</i></p>\
</ol>
html.h1.authenticationPage=\u041F\u0440\u043E\u0432\u0435\u0440\u043A\u0430 \u0438\u043C\u0435\u043D \u0438 \u043F\u0430\u0440\u043E\u043B\u0435\u0439
html.title.authenticationPage=\u0422\u0443\u0442 JWT flow with schema
html.article.authenticationPage=<p>\u041A\u0430\u0436\u0434\u043E\u0435 \u043E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043A \u0441\u0430\u0439\u0442\u0443 \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442 \u0447\u0435\u0440\u0435\u0437 \u0444\u0438\u043B\u044C\u0442\u0440\u044B \u0431\u0435\u0437\u043E\u043F\u0430\u0441\u043D\u043E\u0441\u0442\u0438.</p>\
<p>\u041E\u0431\u0449\u0438\u0439 \u0434\u043E\u0441\u0442\u0443\u043F \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D \u043A \u0432\u0441\u0435\u043C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430\u043C \u0432\u043D\u0435\u0448\u043D\u0435\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043A \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u043B\u043E\u0433\u0438\u043D\u0430 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0433\u043E.</p>\
<h3>\u0414\u041B\u042F \u0417\u0410\u0420\u0415\u0413\u0418\u0421\u0422\u0420\u0418\u0420\u041E\u0412\u0410\u041D\u041D\u042B\u0425 \u041F\u041E\u041B\u042C\u0417\u041E\u0412\u0410\u0422\u0415\u041B\u0415\u0419</h3>\
<p>\u041F\u043E\u0441\u043B\u0435 \u0443\u0441\u043F\u0435\u0448\u043D\u043E\u0433\u043E \u043B\u043E\u0433\u0438\u043D\u0430 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0433\u0435\u043D\u0435\u0440\u0438\u0440\u0443\u0435\u0442 \u0441\u0430\u043C\u043E\u0432\u044B\u043F\u0438\u0441\u0430\u043D\u043D\u044B\u0439 <a href="https://jwt.io/">JWT token</a> \u0438 \u0432 \u043E\u0442\u0432\u0435\u0442\u0435 \u043F\u043E\u0448\u043B\u0435\u0442 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044E \u043A\u0443\u043A\u0443 "workshopAuthentication", \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0449\u0443\u044E \u0432 \u0441\u0435\u0431\u0435 \u0434\u0430\u043D\u043D\u044B\u0439 JWT-\u0442\u043E\u043A\u0435\u043D, \u043A\u0430\u043A\u043E\u0432\u0443\u044E \u043A\u0443\u043A\u0443 \u0441 \u0442\u043E\u043A\u0435\u043D\u043E\u043C \u0432\u043F\u043E\u0441\u043B\u0435\u0434\u0441\u0442\u0432\u0438\u0438 \u0438 \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0442\u044C \u043F\u0440\u0438 \u043A\u0430\u0436\u0434\u043E\u043C \u043E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u0438.</p>\
<h3>\u041F\u0420\u041E\u0426\u0415\u0421\u0421 \u0420\u0415\u0413\u0418\u0421\u0422\u0420\u0410\u0426\u0418\u0418</h3>\
<p>\u041F\u043E\u043A\u0430 \u043D\u0435 \u0433\u043E\u0442\u043E\u0432.\
<br>\
\u041D\u043E \u0434\u043B\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 \u044D\u0442\u043E \u0431\u0443\u0434\u0435\u0442 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F \u0441 \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u043E\u0439 \u043F\u043E\u0447\u0442\u044B, \u043A\u0443\u0434\u0430 \u0440\u0430\u0437\u043E\u0432\u043E \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u0441\u044B\u043B\u0430\u0442\u044C\u0441\u044F \u043A\u043B\u044E\u0447 \u0434\u043B\u044F \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0438, \u043F\u043E\u0441\u043B\u0435 \u0447\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u0431\u0443\u0434\u0435\u0442 \u043E\u043A\u043E\u043D\u0447\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u043D.</p>
html.title.authorizationPage=\u041F\u0440\u043E\u0446\u0435\u0441\u0441 \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0438 \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 (Authorization)
html.h1.authorizationPage=\u041F\u0440\u043E\u0446\u0435\u0441\u0441 \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0438 \u043F\u0440\u0430\u0432 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 (\u0430\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u044F)
html.h1.underConstructionPage=\u0427\u0442\u043E \u0435\u0449\u0435 \u0432 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0435 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438
html.article.underConstructionPage=<ul>\
        <li>\
        \u041F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043F\u0440\u043E\u0435\u043A\u0442 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u043D \u043A\u0430\u043A REST-\u0441\u0435\u0440\u0432\u0438\u0441, \u0442\u043E \u043E\u0441\u043D\u043E\u0432\u043D\u0430\u044F \u043A\u043B\u0438\u0435\u043D\u0442\u0441\u043A\u0430\u044F \u0447\u0430\u0441\u0442\u044C \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0430 \u0432 \u0432\u0438\u0434\u0435\
        \u043E\u0434\u043D\u043E\u0441\u0442\u0440\u0430\u043D\u0438\u0447\u043D\u043E\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u043D\u0430 React, \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u044E\u0449\u0435\u0433\u043E JSON \u0432 \u0432\u0438\u0434\u0435 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0435\u0439 \u0432 \u043E\u0431\u0435\u0440\u0442\u043A\u0435 HATEOAS \u0441 \u043D\u0430\u0431\u043E\u0440\u043E\u043C \u0441\u0441\u044B\u043B\u043E\u043A \u0434\u043B\u044F\
        \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u0438\u043C\u0438 \u0438 \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u043C\u0438 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u044F\u043C\u0438, \u0430 \u044D\u0442\u043E \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u043E\u0439 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u043D\u0430 JavaScript.\
        </li>\
        <li>\u0417\u0430\u043A\u0430\u0437\u044B \u043C\u043E\u0433\u0443\u0442 \u043F\u0440\u0438\u043D\u0438\u043C\u0430\u0442\u044C\u0441\u044F \u043E\u0442 \u043A\u043B\u0438\u0435\u043D\u0442\u043E\u0432 \u043F\u0440\u044F\u043C\u043E \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440\u043E\u043C, \u043A\u043E\u0433\u0434\u0430 \u043D\u043E\u043C\u0435\u0440 \u0437\u0430\u043A\u0430\u0437\u0430 \u0438 \u0441\u0442\u0435\u043F\u0435\u043D\u044C \u0435\u0433\u043E \u0433\u043E\u0442\u043E\u0432\u043D\u043E\u0441\u0442\u0438 \u0432\u044B\u0441\u044B\u043B\u0430\u044E\u0442\u0441\u044F\
        \u043A\u043B\u0438\u0435\u043D\u0442\u0443 \u043F\u043E \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0443 - \u0432\u043E\u0442 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u043D\u044B\u0439 \u0441\u0435\u0440\u0432\u0438\u0441 \u0438 \u0435\u0441\u0442\u044C \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u0430\u044F \u043D\u0435\u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0437\u0430\u0434\u0430\u0447\u0430.\
        </li>\
	</ul>
html.article.authorizationPage=<ul>\
    <li>\
    \u041A\u0430\u0436\u0434\u0430\u044F \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u044C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0438\u043C\u0435\u0435\u0442 \u0441\u0432\u043E\u0439 \u0442\u0438\u043F (<b>WorkshopEntityType</b>) \u043F\u0440\u043E\u0441\u0442\u043E \u043F\u043E \u0441\u0432\u043E\u0435\u043C\u0443 \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u044E: <b>Order</b>, <b>Task</b>, <b>User</b> etc.\
    </li>\
    <li>\
    <p>\u0411\u0430\u0437\u043E\u0432\u044B\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F (<b>AuthorityPermissions</b>) \u0434\u043B\u044F \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u043A \u043A\u0430\u0436\u0434\u043E\u0439 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0438 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u044B \u043D\u0430 Http-\u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0430\u0445: <b>GET</b> (Read), <b>PUT</b> (Write), <b>POST</b> (Create), <b>DELETE</b> (Delete).</p>\
    <p>\u041A\u0430\u0436\u0434\u043E\u0435 \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u043E\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u0432\u043A\u043B\u044E\u0447\u0430\u0435\u0442 \u0442\u0438\u043F \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0438 \u043D\u0430\u0431\u043E\u0440 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0435\u0439 \u0434\u043B\u044F \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0442\u0438\u043F\u0430. \u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, AuthorityPermission "PUT (Order, Classifier)" \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0432\u043D\u043E\u0441\u0438\u0442\u044C \u043F\u0440\u0430\u0432\u043A\u0438 \u0432 \u0417\u0430\u043A\u0430\u0437\u044B \u0438 \u041A\u043B\u0430\u0441\u0441\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B.</p>\
    </li>\
    <li>\
    <p>\u041D\u0430\u0431\u043E\u0440 \u0442\u0430\u043A\u0438\u0445 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u0439 \u0433\u0440\u0443\u043F\u043F\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0432 \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0435 \u0420\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F (<b>InternalAuthorities</b> \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432 \u0438 <b>ExternalAuthorities</b> \u0434\u043B\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439).</p>\
    <p>\u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, <b>InternalAuthority</b> "<b>HR_WRITE</b>" \u0431\u0443\u0434\u0435\u0442 \u0432\u043A\u043B\u044E\u0447\u0430\u0442\u044C \u0432 \u0441\u0435\u0431\u044F \u043F\u0440\u0435\u0434\u0432\u0430\u0440\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u043E\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u0435 <b>"PUT (Order, Classifier)"</b> \u0438 <b>"GET (Order, Classifier, User, Task)"</b>, \u0447\u0442\u043E \u043F\u043E\u0432\u043E\u043B\u0438\u0442 \u0435\u043C\u0443 \u0432\u043D\u043E\u0441\u0442\u0438\u0442\u044C \u043F\u0440\u0430\u0432\u043A\u0438 \u0432 \u0417\u0430\u043A\u0430\u0437\u044B \u0438 \u041A\u043B\u0430\u0441\u0441\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043F\u0440\u043E\u0441\u0442\u043E \u0447\u0438\u0442\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u043E\u0442\u0434\u0435\u043B\u044C\u043D\u044B\u0445 \u0417\u0430\u0434\u0430\u0447 \u0438 \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439.</p>\
    </li>\
    <li>\
    <p>\u041D\u0443 \u0438 \u043D\u0430\u0431\u043E\u0440 \u0442\u0430\u043A\u0438\u0445 <b>InternalAuthorities</b> \u0440\u0430\u0437\u0434\u0430\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0439 \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u0438 (<b>Position</b>) \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432, \u0432 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0438 \u0441 \u043A\u0430\u043A\u043E\u0432\u044B\u043C \u043D\u0430\u0431\u043E\u0440\u043E\u043C \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u0438 \u0440\u0430\u0437\u043D\u044B\u0445 \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u0435\u0439 \u0432\u0438\u0434\u044F\u0442 \u0438\u043B\u0438 \u043D\u0435 \u0432\u0438\u0434\u044F\u0442 \u0442\u0435 \u0438\u043B\u0438 \u0438\u043D\u044B\u0435 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0438.</p>\
    <p><b>ExternalAuthorities</b> \u0436\u0435 \u0440\u0430\u0437\u0434\u0430\u044E\u0442\u0441\u044F \u043F\u043E\u0434\u043E\u0431\u043D\u044B\u043C\u0438 \u043D\u0430\u0431\u043E\u0440\u0430\u043C\u0438 \u0434\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u0432\u043D\u0435\u0448\u043D\u0435\u0433\u043E \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F.</p>\
    </li>\
</ul>
html.title.underConstructionPage=\u0412 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0435
html.title.tecnologiesPage=\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438
html.h1.technologiesPage=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C\u044B\u0435 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0435
html.article.technologies-demo=<ul>\
	        <li id="springBoot">\
	        <p><b>Spring Boot</b></p>\
	        \u0423\u043F\u0440\u043E\u0449\u0435\u043D\u043D\u044B\u0439 \u0441\u0442\u0430\u0440\u0442, \u0442.\u043A. \u0432\u0435\u0441\u044C \u0430\u0434\u0441\u043A\u0438\u0439 \u0437\u043E\u043E\u043F\u0430\u0440\u043A \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0439 \u0441 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u044F\u043C\u0438 \u0438 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430\u043C\u0438 \u043F\u043E-\u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E \u043F\u043E\u0434\u0442\u044F\u0433\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438. \u041F\u0440\u043E\u0441\u0442\u043E \u043F\u0440\u043E\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u043C \u043D\u0443\u0436\u043D\u044B\u0439 \u0441\u0442\u0430\u0440\u0442\u0435\u0440 \u0438 \u0442\u0430\u043C \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u043E \u043F\u043E\u0447\u0442\u0438 \u0432\u0441\u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0435.\
	        \u041F\u043B\u043B\u044E\u0441 \u0432\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u044B\u0439 \u0441\u0435\u0440\u0432\u0435\u0440 Tomcat, \u0441\u0442\u0430\u0440\u0442\u0443\u044E\u0449\u0438\u0439 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435\u043C.\
	        </li>\
	        <li id="springMvc">\
	        <p><b>Spring MVC</b></p>\
	        		\u0427\u0430\u0441\u0442\u044C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F (\u043D\u0430 \u0434\u0430\u043D\u043D\u044B\u0439 \u043C\u043E\u043C\u0435\u043D\u0442, \u0432\u043E\u043E\u0431\u0449\u0435 \u0432\u0441\u0435) \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u0432 \u043E\u0431\u044B\u0447\u043D\u043E\u043C \u0440\u0435\u0436\u0438\u043C\u0435 web-\u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u0441 \u043E\u0431\u044B\u0447\u043D\u044B\u043C\u0438 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430\u043C\u0438.\
	        </li>\
			<li id="thymeleaf">\
				<p><b>Thymeleaf / HTML/CSS</b></p>\
					 <ul>\
	        		 <li>Thymeleaf</li>\
                     \u041F\u0440\u0435\u043A\u0440\u0430\u0441\u043D\u044B\u0439 \u0448\u0430\u0431\u043B\u043E\u043D\u0438\u0437\u0430\u0442\u043E\u0440 HTML-\u0441\u0442\u0440\u0430\u043D\u0438\u0446, \u043D\u0430\u043C\u043D\u043E\u0433\u043E \u043B\u0443\u0447\u0448\u0435 \u0438 \u044D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u0435\u0435 \u0437\u0430\u043C\u0435\u043D\u044F\u044E\u0449\u0438\u0439 \u0443\u0441\u0442\u0430\u0440\u0435\u0432\u0448\u0438\u0439 JSP.\
	        		<li>HTML/CSS</li>\
	        		\u0422\u0443\u0442 \u043D\u0438\u043A\u0430\u043A\u0438\u0445 \u043F\u043E\u0441\u0442-\u043F\u0440\u043E\u0446\u0435\u0441\u0441\u043E\u0440\u043E\u0432, \u043F\u043E\u043F\u0438\u043A\u0441\u0435\u043B\u044C\u043D\u043E \u0432\u044B\u0432\u0435\u0440\u0435\u043D\u043D\u043E\u0439 \u0432\u0435\u0440\u0441\u0442\u043A\u0438, \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u043E\u0433\u043E \u0434\u0438\u0437\u0430\u0439\u043D\u0430 \u0438 \u043F\u0440\u043E\u0447\u0438\u0445 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u0445 \u043F\u0440\u0438\u0447\u0443\u0434 \u0434\u043B\u044F \u0432\u0435\u0440\u0441\u0442\u0430\u043B\u044C\u0449\u0438\u043A\u043E\u0432.\
	        	</ul>\
\
			</li>\
	        <li id="springSecurity">\
	        <p><b>Spring Security / JWT</b></p>\
	        	<ul>\
	        		<li>\
	        		<p>Spring Security</p>\
					\u0414\u043E\u0441\u0442\u0443\u043F \u043A \u043D\u0435\u043F\u0443\u0431\u043B\u0438\u0447\u043D\u043E\u0439 \u0447\u0430\u0441\u0442\u0438 \u043F\u0440\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u043A\u0430\u0441\u043A\u0430\u0434\u043E\u043C \u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432, \u0432\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u044B\u0445 \u0432 \u0434\u0430\u043D\u043D\u044B\u0439 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A.\
					<br>\
					\u0414\u043B\u044F REST-\u0447\u0430\u0441\u0442\u0438 - \u044D\u0442\u043E \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0430 \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u043E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u044F, \u0434\u043B\u044F MVC-\u0447\u0430\u0441\u0442\u0438 - \u0437\u0430\u043F\u0438\u0441\u044C \u0432 \u0441\u0435\u0441\u0441\u0438\u044E.\
					<br>\
					\u041D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0432\u044B\u0434\u0430\u0432\u0430\u0435\u043C\u044B\u0445 GrantedAuthorities \u043F\u0440\u0438 \u0430\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u0438 \u0440\u0430\u0437\u0434\u0430\u0435\u0442\u0441\u044F \u0434\u043E\u0441\u0442\u0443\u043F \u043A \u043C\u0435\u0442\u043E\u0434\u0430\u043C \u0438 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044F\u043C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F.\
					<br>\
					\u0411\u043E\u043B\u0435\u0435 \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E \u0432\u0435\u0441\u044C \u0444\u043B\u043E\u0443 \u0440\u0430\u0441\u043F\u0438\u0441\u0430\u043D \u0432 \u0440\u0430\u0437\u0434\u0435\u043B\u0435 "\u0410\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u044F".\
	        		</li>\
	        		<li>\
	        		<p>JWT</p>\
	        		JSON Web Token \u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u044F \u0434\u043B\u044F \u0441\u0430\u043C\u043E\u0432\u044B\u043F\u0438\u0441\u0430\u043D\u043D\u044B\u0445 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435\u043C \u043A\u043B\u044E\u0447\u0435\u0439, \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0438 \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0438\u0442\u0441\u044F \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439.\
	        		<br>\
	        		\u0411\u043E\u043B\u0435\u0435 \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E \u043F\u0440\u043E \u043F\u0440\u043E\u0446\u0435\u0441\u0441 \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u043E \u0432 \u0440\u0430\u0437\u0434\u0435\u043B\u0435 "\u0410\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F"\
	        		</li>\
	        	</ul>\
	         </li>\
	         <li id="springHateoas">\
	         <p><b>Spring HATEOAS (REST)</b></p>\
	         \u041E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u0435 \u043A \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u043C \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u044F\u043C \u0434\u043E\u043C\u0435\u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u043E \u043D\u0430 REST-\u0442\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u044F\u0445 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E http-\u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u043E\u0432 "get"-\u0447\u0442\u0435\u043D\u0438\u0435, "post"-\u0437\u0430\u043F\u0438\u0441\u044C \u043D\u043E\u0432\u043E\u0433\u043E, "put"-\u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0435 \u0438 "delete"-\u0443\u0434\u0430\u043B\u0435\u043D\u0438\u0435.\
	         <p>\
	         \u0420\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F Hypermedia As The Engine Of Application State \u0441 \u043A\u0430\u0436\u0434\u043E\u0439 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u044C\u044E \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043D\u0430\u0431\u043E\u0440 \u0441\u0441\u044B\u043B\u043E\u043A \u043D\u0430 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u043A\u0430\u043A \u0435\u044E \u0441\u0430\u043C\u043E\u0439 (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0441\u0441\u044B\u043B\u043A\u0430, \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u043C\u043E\u0436\u043D\u043E \u0435\u0435 \u0443\u0434\u0430\u043B\u0438\u0442\u044C), \u0442\u0430\u043A \u0438 \u0441\u0441\u044B\u043B\u043A\u0438 \u043D\u0430 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440 \u0438 \u0443\u043F\u0440\u0430\u043B\u0435\u043D\u0438\u0435 \u0432\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u043C\u0438 \u043E\u0431\u044A\u0435\u043A\u0442\u0430\u043C\u0438.\
	         \u0412\u0438\u0434\u0438\u043C\u043E\u0441\u0442\u044C \u0442\u0435\u0445 \u0438\u043B\u0438 \u0438\u043D\u044B\u0445 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 \u0434\u043B\u044F \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u0437\u0430\u0432\u0438\u0441\u0438\u0442 \u043E\u0442 \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F.\
	         </p>\
	         </li>\
	         <li>\
	         <p><b>JPA (Hibernate)</b></p>\
	         Hibernate \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D \u043A\u0430\u043A \u043D\u0435\u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043D\u043D\u0430\u044F \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u043D\u043E-\u043E\u0440\u0438\u0435\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u043A SQL-\u0442\u0430\u0431\u043B\u0438\u0446\u0430\u043C.\
	         <br>\
	         \u041D\u0430 \u0435\u0433\u043E \u043D\u0430\u0442\u0438\u0432\u043D\u044B\u0445 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044F\u0445 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043E \u043A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0432\u0442\u043E\u0440\u043E\u0433\u043E \u0443\u0440\u043E\u0432\u043D\u044F. \u0414\u043B\u044F \u0432\u0441\u0435\u0433\u043E \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u044B \u0432\u044B\u0437\u043E\u0432\u044B \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u043E\u0433\u043E \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 JPA.\
	         <p>\u042F\u0437\u044B\u043A \u0437\u0430\u043F\u0440\u043E\u0441\u043E\u0432 CriteriaAPI \u0438\u0434\u0435\u0442 \u0432\u043F\u0435\u0440\u0435\u043C\u0435\u0448\u043A\u0443 \u0441 JPQL \u0434\u043B\u044F \u043F\u0440\u0430\u043A\u0442\u0438\u043A\u0438.</p>\
	         <p><i>\u0427\u0435\u0441\u0442\u043D\u043E \u0433\u043E\u0432\u043E\u0440\u044F, \u0432 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430\u0445 \u043F\u043E\u043A\u0430 \u0435\u0449\u0435 \u043C\u043D\u043E\u0433\u043E \u0442\u0443\u043F\u044B\u0445 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u0441\u0443\u0449\u043D\u043E\u0441\u0442\u0435\u0439 \u0446\u0435\u043B\u0438\u043A\u043E\u043C \u0434\u043B\u044F \u0438\u0445 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F, \u0447\u0442\u043E \u043F\u0440\u043E\u0441\u0442\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0434\u043B\u044F \u043C\u0430\u043B\u0435\u043D\u044C\u043A\u043E\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F. \u041D\u043E \u0434\u043B\u044F \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u0438 \u0432\u0441\u0435 \u044D\u0442\u043E \u0434\u043E\u043B\u0436\u043D\u043E \u0437\u0430\u043C\u0435\u043D\u044F\u0442\u044C\u0441\u044F \u043D\u0430 \u043D\u0435\u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0435 \u0437\u0430\u043F\u0438\u043F\u0438 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E JPQL.</i>\
	         </p>\
	         </li>\
	         <li id="sql">\
	         <p><b>SQL (H2 database)</b></p>\
	         \u0412 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0431\u0430\u0437\u044B \u0434\u0430\u043D\u043D\u044B\u0445 SQL \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0430 H2, \u043F\u043E\u0442\u043E\u043C\u0443 \u0447\u0442\u043E \u043E\u043D\u0430 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u043A\u0430\u043A \u044F\u0432\u0430-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u043F\u0440\u0435\u043A\u0440\u0430\u0441\u043D\u043E \u0441\u043E\u0432\u043C\u0435\u0441\u0442\u0438\u043C\u043E \u0441\u043E \u043C\u043D\u043E\u0433\u0438\u043C\u0438 SQL-\u0434\u0438\u0430\u043B\u0435\u043A\u0442\u0430\u043C\u0438 \u0438 \u043C\u043E\u0436\u0435\u0442 \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u043A\u0430\u043A \u0432\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u0430\u044F \u0431\u0430\u0437\u0430 - \u0441\u0442\u0430\u0440\u0442\u0443\u0435\u0442 \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435\u043C, \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442 \u0432\u0441\u0435 \u0432 \u043F\u0430\u043C\u044F\u0442\u044C, \u0438 \u0432\u044B\u043A\u043B\u044E\u0447\u0430\u0435\u0442\u0441\u044F \u0432\u043C\u0435\u0441\u0442\u0435 \u0441 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435\u043C.\
	         </li>\
	         <li id="hibernateValidation">\
	         <p><b>Hibernate Validation, Jackson JSON, Lombok, Ehcache</b></p>\
	         \u0412\u0441\u044F\u043A\u0438\u0435 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438.\
	         </li>\
	         <li id="test">\
	         <p><b>\u0422\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435: JUnit \u0438 Mockito</b></p>\
	         \u042E\u043D\u0438\u0442-\u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0438 \u0438\u043D\u0442\u0435\u0433\u0440\u0430\u0446\u0438\u043E\u043D\u043D\u043E\u0435 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435. \u041F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0435 \u043D\u0430\u043C\u043D\u043E\u0433\u043E \u0447\u0430\u0449\u0435, \u0442.\u043A. \u0432 \u043C\u0430\u043B\u0435\u043D\u044C\u043A\u043E\u043C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0438\u043D\u043E\u0433\u0434\u0430 \u0443\u0434\u043E\u0431\u043D\u0435\u0435 \u0441\u0440\u0430\u0437\u0443 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u043A\u0432\u043E\u0437\u043D\u043E\u0439 \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B, \u0447\u0435\u043C \u0433\u043E\u0440\u043E\u0434\u0438\u0442\u044C \u043A\u0443\u0447\u0443 \u043C\u043E\u043A\u043E\u0432.\
	         </li>\
			 	<li>\
				<p><b>JavaScript</b></p>\
				\u041D\u0435\u043C\u043D\u043E\u0433\u043E \u0441\u043A\u043F\u0440\u0438\u043F\u0442\u043E\u0432\u044B\u0445 \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u043E\u0432 \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0447\u043A\u0430\u0445 \u0432 \u0441\u0442\u0438\u043B\u0435 ES6. AJAX-\u0437\u0430\u043F\u0440\u043E\u0441\u044B, \u0432\u0430\u043B\u0438\u0434\u0430\u0446\u0438\u044F, \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0435 \u0441\u0442\u0438\u043B\u0435\u0439 \u0438 \u043F\u0440\u043E\u0447\u0435\u0435, \u0434\u043E\u0431\u0430\u0432\u043B\u044F\u044E\u0449\u0435\u0435 \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0438\u043D\u0442\u0435\u0440\u0430\u043A\u0442\u0438\u0432\u043D\u043E\u0441\u0442\u0438. \u041D\u0438\u043A\u0430\u043A\u0438\u0445 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A \u0438\u043B\u0438 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u043E\u0432 \u043D\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043B\u043E\u0441\u044C \u0438\u043C\u0435\u043D\u043D\u043E \u0441 \u0446\u0435\u043B\u044C\u044E \u043F\u043E\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441 \u044F\u0437\u044B\u043A\u043E\u043C \u043D\u0430\u043F\u0440\u044F\u043C\u0443\u044E.\
	         </li>\
	    </ul>
html.upNav.upperMenu.projectTechnogies.sqlH2=SQL (H2 database)
html.article.designComplaint=<p>\u0420\u0438\u0441\u043E\u0432\u0430\u0442\u044C \u043D\u0435 \u0443\u043C\u0435\u044E \u0438 \u043D\u0435 \u0431\u0443\u0434\u0443. \u0414\u0438\u0437\u0430\u0439\u043D \u0443 \u043C\u0435\u043D\u044F \u0434\u043E\u0432\u043E\u043B\u044C\u043D\u043E \u0431\u0435\u0441\u0445\u0438\u0442\u0440\u043E\u0441\u0442\u043D\u044B\u0439.\
	<br>\
	\u0412\u0435\u0440\u0441\u0442\u043A\u0430, \u0441\u0442\u0438\u043B\u0438, \u043E\u0431\u0440\u0435\u0437\u0430\u043D\u0438\u0435 \u043F\u0438\u043A\u0441\u0435\u043B\u0435\u0439 - \u044D\u0442\u043E \u043C\u0443\u0442\u043E\u0440\u043D\u043E, \u0434\u043E\u043B\u0433\u043E \u0438 \u043D\u0435 \u0430\u0445\u0442\u0438 \u043A\u0430\u043A \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u043E.\
	 <br>\
	 \u041F\u043E\u043A\u0430 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0435 \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0431\u044B\u0447\u043D\u044B\u0439 HTML + \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0430 CSS \u0441\u0442\u0438\u043B\u0435\u0439 \u0434\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0439 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B.\
	 <br>\
	 <p>\u0416\u0430\u043B\u043E\u0431\u0430 \u043F\u0440\u0438\u043D\u044F\u0442\u0430 )))</P\
	 </p>
html.a.text.close=\u0417\u0430\u043A\u0440\u044B\u0442\u044C
html.upNav.upperMenu.projectTechnogies.etc=Hibernate Validation, Jackson JSON, Lombok ...
html.upNav.upperMenu.projectTechnogies.test=JUnit / Mockito
html.a.text.shutdown=X
html.button.title.shutdown=\u0417\u0430\u043A\u0440\u044B\u0442\u044C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435
email.simpleMessage.subject.orderFinished(1)=\u0412\u0430\u0448 \u0437\u0430\u043A\u0430\u0437 \u2116 {0} \u0433\u043E\u0442\u043E\u0432 \u043A \u0432\u044B\u0434\u0430\u0447\u0435
email.simpleMessage.text.orderFinished(2)=\u041C\u044B \u0440\u0430\u0434\u044B \u0441\u043E\u043E\u0431\u0449\u0438\u0442\u044C, \u0447\u0442\u043E \u0412\u0430\u0448 \u0437\u0430\u043A\u0430\u0437\u2116 {0} \u0433\u043E\u0442\u043E\u0432 \u0438 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0435\u0433\u043E \u0432 \u043B\u044E\u0431\u043E\u0435 \u0443\u0434\u043E\u0431\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F! \n {1}
html.span.workshopMotto=Keep it simple.
html.a.href.contacts.gitHub=https://github.com/BAXMYPKA
html.a.text.gitHubPfofile=\u041F\u0440\u043E\u0444\u0438\u043B\u044C \u043D\u0430 GItHub:
html.h4.contacts=\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u044B:
html.article.aboutMe=\u0422\u0443\u0442 \u043F\u0440\u043E \u0441\u0435\u0431\u044F \u043D\u0435\u043C\u043D\u043E\u0433\u043E.
html.h1.aboutMe=\u041E\u0431\u043E \u043C\u043D\u0435
html.upNav.upperMenu.projectTechnogies.thymeleafHtmlCss=Thymeleaf / HTML/CSS
html.section.login.main=<p>\u042D\u0442\u043E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0432\u043E \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0439 \u0440\u0430\u0437\u0434\u0435\u043B \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432.</p>\
	<p>\u041B\u043E\u0433\u0438\u043D - \u044D\u0442\u043E \u043F\u043E\u0447\u0442\u0430, \u0430 \u043F\u0430\u0440\u043E\u043B\u0438 \u0443 \u0432\u0441\u0435\u0445, \u0434\u043B\u044F \u0443\u043F\u0440\u043E\u0449\u0435\u043D\u0438\u044F, "12345". \u0421\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u0438\u0434\u0435\u0442\u044C \u0441\u043F\u0440\u0430\u0432\u0430.</p>\
	<p>\u0423 \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u0430 \u0441\u0432\u043E\u044F \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C \u0438 \u043A\u0430\u0436\u0434\u0430\u044F \u0434\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C \u0438\u043C\u0435\u0435\u0442 \u0441\u0432\u043E\u0438 \u043F\u0440\u0430\u0432\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u0430.</p>\
	<p>\u0421\u0430\u043C\u044B\u0439 \u043F\u043E\u043B\u043D\u044B\u0439 \u0434\u043E\u0441\u0442\u0443\u043F \u043A\u043E \u0432\u0441\u0435\u043C \u0440\u0430\u0437\u0434\u0435\u043B\u0430\u043C \u0441\u043E \u0432\u0441\u0435\u043C\u0438 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0438\u044F\u043C\u0438 \u0438\u043C\u0435\u0435\u0442 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C "admin@workshop.pro" \u0441\u043E \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u043C \u043F\u0430\u0440\u043E\u043B\u0435\u043C "12345".</p>\
	<p>\u042F\u0437\u044B\u043A\u043E\u0432 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u0432\u0430 - \u0420\u0443\u0441\u0441\u043A\u0438\u0439 \u0438 \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 (\u043F\u043E-\u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E). \u042F\u0437\u044B\u043A \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u043F\u043E\u0434\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F	\u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0438\u0437 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u0430 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 "Accept-Language", \u043F\u043E\u0441\u043B\u0435 \u0441\u043C\u0435\u043D\u044B \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u0443\u043A\u0443.</p>
html.h1.internal.login=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.thead.internal.login.predefinedEmployees=\u0421\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
properties.fullName=\u041F\u043E\u043B\u043D\u043E\u0435 \u0438\u043C\u044F
properties.email=\u041F\u043E\u0447\u0442\u0430
properties.position=\u0414\u043E\u043B\u0436\u043D\u043E\u0441\u0442\u044C
properties.department=\u041E\u0442\u0434\u0435\u043B
properties.language=\u042F\u0437\u044B\u043A
html.a.text.index-demo=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0434\u0435\u043C\u043E-\u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430
html.a.title.index-demo=\u0412\u0445\u043E\u0434 \u043D\u0430 \u0433\u043B\u0430\u0432\u043D\u0443\u044E \u0434\u0435\u043C\u043E-\u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 \u0441 \u0434\u0435\u0442\u0430\u043B\u044F\u043C\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.a.text.index=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430
html.a.title.index=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 WORKSHOP \u0434\u043B\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439.
html.a.text.internalPage=\u0412\u0445\u043E\u0434 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.a.title.internalPage=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.h1.index=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 Workshop Bicycles
html.article.index=<p>\u041D\u0430\u0448\u0430 \u0443\u0441\u043B\u043E\u0432\u043D\u0430\u044F \u0432\u0435\u043B\u043E\u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u0430\u044F \u0441 \u0448\u0438\u0440\u043E\u043A\u0438\u043C \u0441\u043F\u0435\u043A\u0442\u0440\u043E\u043C \u0443\u0441\u043B\u0443\u0433 \u043A \u0432\u0430\u0448\u0438\u043C \u0443\u0441\u043B\u0443\u0433\u0430\u043C.</p>\
	<p>\
		\u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043E\u0444\u043E\u0440\u043C\u0438\u0442\u044C \u0437\u0430\u043A\u0430\u0437 \u0434\u0432\u0443\u043C\u044F \u043F\u0443\u0442\u044F\u043C\u0438:\
	<ol>\
		<li>\
			\u041B\u0438\u0447\u043D\u043E \u043F\u043E\u0441\u0435\u0442\u0438\u0432 \u043D\u0430\u0448 \u043E\u0444\u0438\u0441 \u0441 \u0432\u0430\u0448\u0438\u043C \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u043E\u043C \u0438\u043B\u0438 \u0434\u0435\u0442\u0430\u043B\u044F\u043C\u0438, \u0442\u0440\u0435\u0431\u0443\u044E\u0449\u0438\u043C\u0438 \u043E\u0441\u043B\u0443\u0436\u0438\u0432\u0430\u043D\u0438\u044F.\
		</li>\
		<li>\
			\u041F\u0440\u0435\u0434\u0432\u0430\u0440\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0432\u0448\u0438\u0441\u044C \u043D\u0430 \u0441\u0430\u0439\u0442\u0435, \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0432\u0430\u043C \u043F\u0435\u0440\u0435\u0447\u0435\u043D\u044C \u0443\u0441\u043B\u0443\u0433, \u0443\u0432\u0438\u0434\u0435\u0442\u044C \u0446\u0435\u043D\u0443 \u0438\
			\u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437, \u043D\u043E\u043C\u0435\u0440 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0441\u043E\u043E\u043E\u0431\u0449\u0438\u0442\u044C \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440\u0443 \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0441\u0434\u0430\u0447\u0438 \u043D\u0430\u043C \u0432\u0430\u0448\u0435\u0433\u043E \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u0430 \u0438\u043B\u0438\
			\u0434\u0435\u0442\u0430\u043B\u0435\u0439 \u043A \u043D\u0435\u043C\u0443.\
		</li>\
		<p>\
			\u041C\u0435\u043D\u044E \u0432\u0445\u043E\u0434\u0430 \u043D\u0430 \u0441\u0430\u0439\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0441\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u0438 \u0434\u0430\u0436\u0435 \u0432\u0431\u0438\u0442\u044B\u0445 \u0432 \u043F\u043E\u043B\u044F \u0432\u0432\u043E\u0434\u0430 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439. \u041F\u043E\u0441\u043B\u0435 \u0432\u0445\u043E\u0434\u0430 \u043F\u043E\u0434 \u043B\u044E\u0431\u044B\u043C \u0438\u0437 \u043D\u0438\u0445 \u0431\u0443\u0434\u0443\u0442 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B \u043F\u0443\u043D\u043A\u0442\u044B \u043C\u0435\u043D\u044E \u0434\u043B\u044F \u0441\u0431\u043E\u0440\u043A\u0438 \u0437\u0430\u043A\u0430\u0437\u0430 \u043E\u043D\u043B\u0430\u0439\u043D.\
		</p>\
		<p>\
			\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F \u0442\u043E\u0436\u0435 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442. \u0415\u0435 \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C \u043E\u043F\u0438\u0441\u0430\u043D\u0430 \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438.\
		</p>\
	</ol>\
</p>
html.a.index.loginRegistration=\u0412\u0445\u043E\u0434 / \u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F
html.article.login=<p>\
\u0418\u043C\u044F \u043B\u043E\u0433\u0438\u043D\u0430 - \u043F\u043E\u0447\u0442\u043E\u0432\u044B\u0439 \u0430\u0434\u0440\u0435\u0441.\
<br>\
\u041F\u043E\u0441\u043B\u0435 \u0432\u0445\u043E\u0434\u0430 \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0441\u0432\u043E\u0439 \u043F\u0440\u043E\u0444\u0438\u043B\u044C, \u0441\u0432\u043E\u0438 \u0437\u0430\u043A\u0430\u0437\u044B \u0438 \u0441\u043E\u0431\u0440\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437 \u043E\u043D\u043B\u0430\u0439\u043D.\
<br><br>\
\u041D\u0438\u0436\u0435 \u0435\u0441\u0442\u044C \u0441\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439, \u043F\u0430\u0440\u043E\u043B\u044C \u0434\u043B\u044F \u0432\u0441\u0435\u0445 "12345".\
<br>\
\u041C\u043E\u0436\u043D\u043E \u0432\u043E\u0439\u0442\u0438 \u043F\u043E\u0434 \u043B\u044E\u0431\u044B\u043C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u043C \u0438 \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C \u0435\u0433\u043E \u0434\u0430\u043D\u043D\u044B\u0435, \u0437\u0430\u043A\u0430\u0437\u044B \u0438 \u0442.\u043F.\
<br><br>\
\u041F\u0440\u043E\u0446\u0435\u0441\u0441 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043E\u043F\u0438\u0441\u0430\u043D \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435 \u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043F\u043E \u043A\u043B\u0438\u043A\u0443 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0439 \u043A\u043D\u043E\u043F\u043A\u0438.\
<br><br>\
<i>\
\u041F\u043E\u043B\u044F \u0432\u0432\u043E\u0434\u0430 \u0438\u043D\u0442\u0435\u0440\u0430\u043A\u0442\u0438\u0432\u043D\u044B. \u0412\u0432\u043E\u0434 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0442\u044C \u043D\u0430\u043B\u0438\u0447\u0438\u0435 \u0442\u0430\u043A\u043E\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u0432 \u0431\u0430\u0437\u0435 \u043F\u043E\u0441\u043B\u0435 \u0432\u0432\u043E\u0434\u0430 \u0430\u0434\u0440\u0435\u0441\u0430, \u0430 \u043F\u0430\u0440\u043E\u043B\u044C \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0442\u044C\u0441\u044F \u043D\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435 \u043C\u0438\u043D\u0438\u043C\u0443\u043C 5 \u0437\u043D\u0430\u043A\u043E\u0432.\
</i>\
</p>
properties.enabled=\u0410\u043A\u0442\u0438\u0432\u0435\u043D
html.thead.external.login.predefinedUsers=\u0421\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0445 \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439
html.a.text.services=\u0421\u043F\u0438\u0441\u043E\u043A \u0443\u0441\u043B\u0443\u0433
html.a.title.services=\u041F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u043C\u044B\u0435 \u0443\u0441\u043B\u0443\u0433\u0438
html.h1.services=\u0421\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0435\u043C\u044B\u0445 \u043D\u0430\u043C\u0438 \u0443\u0441\u043B\u0443\u0433
html.submit.registration=\u0423 \u0432\u0430\u0441 \u043D\u0435\u0442 \u043F\u0440\u043E\u0444\u0438\u043B\u044F? \u0417\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0439\u0442\u0435\u0441\u044C!
html.button.title.registration=\u042D\u043A\u0440\u0430\u043D \u0441 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435\u043C \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0430 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438.
html.a.text.howToGetToUs=\u041A\u0430\u043A \u0434\u043E\u0431\u0440\u0430\u0442\u044C\u0441\u044F
html.a.text.contacts=\u041A\u043E\u043D\u0442\u0430\u043A\u0442\u044B
html.a.text.address=\u0410\u0434\u0440\u0435\u0441
html.a.text.ourWorkshop=\u041D\u0430\u0448\u0430 \u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u0430\u044F
html.a.text.workshopStuff=\u0413\u0430\u043B\u0435\u0440\u0435\u044F \u043D\u0430\u0448\u0438\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.div.workshopBicyclesName=WORKSHOP BICYCLES
html.input.login.loginUsername=sebastian-pidorin@mail.pro
html.input.password.loginPassword=12345
html.upNav.upperMenu.projectTechnogies.javaScript=JavaScript
html.a.text.logout=\u0412\u044B\u0439\u0442\u0438
html.a.title.workshop=\u041D\u0430\u0448\u0430 \u0432\u0435\u043B\u043E\u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u0430\u044F
html.h1.workshop=\u041D\u0430\u0448\u0430 \u0412\u0435\u043B\u043E\u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u0430\u044F
html.a.title.workshopStuff=\u0421\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u0438 \u043D\u0430\u0448\u0435\u0439 \u0432\u0435\u043B\u043E\u043C\u0430\u0441\u0442\u0435\u0440\u0441\u043A\u043E\u0439
html.a.text.buildOrder=\u0421\u043E\u0431\u0440\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437 \u043E\u043D\u043B\u0430\u0439\u043D
html.a.title.buildOrder=\u0421\u043E\u0431\u0440\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437 \u043E\u043D\u043B\u0430\u0439\u043D
html.a.title.profile=\u041F\u0440\u043E\u0444\u0438\u043B\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
properties.created=\u0421\u043E\u0437\u0434\u0430\u043D
html.h1.profile=\u041F\u0440\u043E\u0444\u0438\u043B\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
properties.firstName=\u0418\u043C\u044F
properties.lastName=\u0424\u0430\u043C\u0438\u043B\u0438\u044F
properties.birthday=\u0414\u0430\u0442\u0430 \u0440\u043E\u0436\u0434\u0435\u043D\u0438\u044F
html.thead.profile.tableName=\u0414\u0430\u043D\u043D\u044B\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
properties.phone=\u0422\u0435\u043B\u0435\u0444\u043E\u043D
html.submit.saveChanges=\u0421\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F
html.button.title.deletePhone=\u0423\u0434\u0430\u043B\u0438\u0442\u044C \u0442\u0435\u043B\u0435\u0444\u043E\u043D
properties.phoneName=\u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043D\u043E\u043C\u0435\u0440\u0430
properties.phoneNumber=\u041D\u043E\u043C\u0435\u0440 \u0442\u0435\u043B\u0435\u0444\u043E\u043D\u0430
html.button.title.addPhone=\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0442\u0435\u043B\u0435\u0444\u043E\u043D
properties.phoneNotice=<br><i>\u0414\u043E\u0431\u0430\u0432\u044C\u0442\u0435 \u043D\u043E\u0432\u044B\u0439 \u0442\u0435\u043B\u0435\u0444\u043E\u043D \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0437\u0435\u043B\u0435\u043D\u043E\u0439 \u043A\u043D\u043E\u043F\u043A\u0438 \u0441\u043F\u0440\u0430\u0432\u0430</i>
html.h1.orders=\u0412\u0430\u0448\u0438 \u0417\u0430\u043A\u0430\u0437\u044B
html.a.title.userOrders=\u0412\u0430\u0448\u0438 \u0417\u0430\u043A\u0430\u0437\u044B
html.thead.profile.orders.ordersList=\u0421\u043F\u0438\u0441\u043E\u043A \u0432\u0430\u0448\u0438\u0445 \u0417\u0430\u043A\u0430\u0437\u043E\u0432
properties.id=\u0418\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440
properties.finished=\u0412\u044B\u043F\u043E\u043B\u043D\u0435\u043D
properties.description=\u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435
properties.overallPrice=\u041E\u0431\u0449\u0430\u044F \u0441\u0442\u043E\u0438\u043C\u043E\u0441\u0442\u044C
html.a.title.userOrder=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0437\u0430\u043A\u0430\u0437\u0430
html.thead.profile.orderDetails=\u0414\u0435\u0442\u0430\u043B\u0438 \u0437\u0430\u043A\u0430\u0437\u0430
properties.messageToUser=\u0421\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044E
properties.tasks=\u0412\u043B\u043E\u0436\u0435\u043D\u043D\u044B\u0435 \u0417\u0430\u0434\u0430\u0447\u0438
properties.unroll=\u0420\u0430\u0437\u0432\u0435\u0440\u043D\u0443\u0442\u044C
html.thead.profile.tasks=\u0417\u0430\u0434\u0430\u0447\u0438
properties.price=\u0426\u0435\u043D\u0430
properties.name=\u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435
properties.deadline=\u041A\u0440\u0430\u0439\u043D\u0438\u0439 \u0441\u0440\u043E\u043A \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F
properties.appointedTo=\u041E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0439 \u0438\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C
html.h1.buildOrder=\u0421\u043E\u0437\u0434\u0430\u0439\u0442\u0435 \u0437\u0430\u043A\u0430\u0437 \u043E\u043D\u043B\u0430\u0439\u043D
html.a.title.buildOrderOnline=\u0421\u043E\u0437\u0434\u0430\u043D\u0438\u0435 \u043E\u043D\u043B\u0430\u0439\u043D \u0417\u0430\u043A\u0430\u0437\u0430
properties.photo=\u0424\u043E\u0442\u043E
properties.savePhoto=\u0421\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0444\u043E\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u044E
properties.deletePhoto=\u0423\u0434\u0430\u043B\u0438\u0442\u044C \u0444\u043E\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u044E
html.button.title.deletePhoto=\u0423\u0434\u0430\u043B\u0438\u0442\u044C \u0444\u043E\u0442\u043E\u0433\u0440\u0430\u0444\u0438\u044E