html.h1.login=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432 Workshop
html.submit.login=\u0412\u043E\u0439\u0442\u0438
html.title.login=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.ul.li.leftNav.internalPage.a=\u0412\u0445\u043E\u0434 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.ul.li.leftNav.internalPage.title=\u0421\u0442\u0440\u0430\u043D\u0438\u0446\u0430 \u0432\u0445\u043E\u0434\u0430 \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432
html.ul.li.leftNav.mainPage.a=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430
html.ul.li.leftNav.mainPage.title=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u043E\u0431\u0449\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 WORKSHOP \u0434\u043B\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439.
html.upNav.upperMenu.aboutMe=\u041E\u0431\u043E \u043C\u043D\u0435
html.upNav.upperMenu.designComplaint=\u041F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u0434\u0438\u0437\u0430\u0439\u043D \u0438 \u0432\u0435\u0440\u0441\u0442\u043A\u0443
html.upNav.upperMenu.projectInDetail=\u0414\u0435\u0442\u0430\u043B\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.upNav.upperMenu.projectInDetail.submenu.authorizationSecurity=\u0410\u0432\u0442\u043E\u0440\u0438\u0437\u0430\u0446\u0438\u044F
html.upNav.upperMenu.projectInDetail.submenu.howItWorks=\u041A\u0430\u043A \u044D\u0442\u043E \u0434\u043E\u043B\u0436\u043D\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C
html.upNav.upperMenu.projectInDetail.submenu.authenticationSecurity=\u0410\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F
html.upNav.upperMenu.projectInDetail.title=\u041A\u0430\u043A \u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u0432\u043A\u0440\u0430\u0442\u0446\u0435
html.upNav.upperMenu.projectPurposes=\u0426\u0435\u043B\u044C \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.upNav.upperMenu.projectTechnogies=\u0422\u0435\u0445\u043D\u043E\u043B\u043E\u0433\u0438\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0430
html.upNav.upperMenu.underConstruct=\u0427\u0442\u043E \u0435\u0449\u0435 \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u043E
title=\u0432\u044B\u0430
workshop.motto=\u0421\u0442\u0430\u0440\u0430\u0439\u0442\u0435\u0441\u044C \u043D\u0438\u0447\u0435\u0433\u043E \u043D\u0435 \u0443\u0441\u043B\u043E\u0436\u043D\u044F\u0442\u044C.
workshop.name=WORKSHOP
html.upNav.upperMenu.projectInDetail.submenu.authenticationSecurity.title=\u041A\u0430\u043A \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0435\u0442 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 \u0438 \u0438\u0445 \u043F\u0430\u0440\u043E\u043B\u0438
html.upNav.upperMenu.projectInDetail.submenu.authorizationSecurity.title=\u041A\u0430\u043A \u0440\u0430\u0437\u0434\u0430\u044E\u0442\u0441\u044F \u043F\u0440\u0430\u0432\u0430 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u043A \u0442\u0435\u043C \u0438\u043B\u0438 \u0438\u043D\u044B\u043C \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044F\u043C
html.index.article=<p>\u0412\u0430\u0441 \u043F\u0440\u0438\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0443\u0441\u043B\u043E\u0432\u043D\u043E-\u0442\u0435\u043E\u0440\u0435\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u0438\u043D\u0442\u0435\u0440\u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u044F Workshop \u043D\u0430 \u0441\u0432\u043E\u0435\u0439 \u0433\u043B\u0430\u0432\u043D\u043E\u0439 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435.</p>\
<p>\u0422\u0435\u043E\u0440\u0435\u0442\u0438\u0447\u0435\u0441\u043A\u0438, \u043C\u044B \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u043C \u043B\u044E\u0431\u043E\u0439 \u0441\u043F\u0435\u043A\u0442\u0440 \u0443\u0441\u043B\u0443\u0433. \u0421\u0435\u0439\u0447\u0430\u0441 \u043C\u044B \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u043C \u0432\u0430\u043C \u0422\u041E, \u0440\u0435\u043C\u043E\u043D\u0442 \u0438 \u043B\u044E\u0431\u043E\u0435 \u043E\u0431\u0441\u043B\u0443\u0436\u0438\u0432\u0430\u043D\u0438\u0435 \u0432\u0430\u0448\u0435\u0433\u043E \
\u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u0430.\
\u0415\u0441\u043B\u0438 \u0432\u044B \u043B\u0438\u0447\u043D\u043E \u043F\u043E\u0441\u0435\u0442\u0438\u043B\u0438 \u043D\u0430\u0448 \u043E\u0444\u0438\u0441, \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043E\u0444\u043E\u0440\u043C\u0438\u0442 \u0434\u043B\u044F \u0432\u0430\u0441 \u0437\u0430\u043A\u0430\u0437 \u0438 \u0432\u044B\u0434\u0430\u0441\u0442 \u0432\u0430\u043C \u0435\u0433\u043E \u043D\u043E\u043C\u0435\u0440, \u0430 \u043D\u0430 \u0441\u0430\u0439\u0442\u0435, \u0431\u0435\u0437 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438, \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043E\u0442\u0441\u043B\u0435\u0434\u0438\u0442\u044C \u0435\u0433\u043E \u0441\u0442\u0435\u043F\u0435\u043D\u044C \u0433\u043E\u0442\u043E\u0432\u043D\u043E\u0441\u0442\u0438.\
\u0415\u0441\u043B\u0438 \u0432\u044B \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0435\u0442\u0435\u0441\u044C, \u0442\u043E \u0441\u043C\u043E\u0436\u0435\u0442\u0435 \u0441\u0430\u043C\u0438 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437\u044B, \u0432\u044B\u0431\u0438\u0440\u0430\u044F \u0438\u0437 \u043F\u0440\u0430\u0439\u0441\u0430 \u043D\u0443\u0436\u043D\u044B\u0435 \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u0443\u0441\u043B\u0443\u0433\u0438, \u0447\u0442\u043E\u0431\u044B \
\u043F\u0440\u0438\u0432\u0435\u0437\u0442\u0438 \u043A \u043D\u0430\u043C \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434 \u043F\u043E\u0437\u0436\u0435.</p>\
\
<p>\u042F\u0437\u044B\u043A\u043E\u0432 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u0432\u0430 - \u0420\u0443\u0441\u0441\u043A\u0438\u0439 \u0438 \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 (\u043C\u044B \u0436\u0435\u0436 \u0438\u043D\u0442\u0435\u0440\u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u044F!). \u042F\u0437\u044B\u043A \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u043F\u043E\u0434\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F\
\u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0438\u0437 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u0430 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 "Accept-Language", \u043F\u043E\u0441\u043B\u0435 \u0441\u043C\u0435\u043D\u044B \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u0443\u043A\u0443 \u0438 \u0432\u043E\u043E\u0431\u0449\u0435 \u0432\u0441\u0435 \u0441\u0442\u0430\u043D\u043E\u0432\u0438\u0442\u0441\u044F \u043D\u0430 \u0434\u0440\u0443\u0433\u043E\u043C\
 \u044F\u0437\u044B\u043A\u0435. \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439 \u043F\u043E-\u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E.</p>\
\
<p>\u0412\u0435\u0441\u044C \u043F\u0440\u043E\u0435\u043A\u0442 \u0434\u0435\u043B\u0438\u0442\u0441\u044F \u043D\u0430 \u0434\u0432\u0430 \u0434\u043E\u043C\u0435\u043D\u0430 - \u0432\u043D\u0435\u0448\u043D\u0438\u0439 (External) \u0434\u043B\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0435\u0439 \u0438 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0439 (Internal) \u0434\u043B\u044F \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432. \u0423\
\u0412\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0433\u043E \u043F\u043E\u043A\u0430 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\
\u0442\u043E\u043B\u044C\u043A\u043E \u0431\u044D\u043A\u0435\u043D\u0434, \u0430 \u0412\u043D\u0435\u0448\u043D\u0438\u0439 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0435.</p>\
\
<p>\u041F\u0440\u0438 \u0437\u0430\u043F\u0443\u0441\u043A\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F \u0441\u0435\u0440\u0432\u0435\u0440 \u0441 \u0431\u0430\u0437\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u043F\u0430\u043C\u044F\u0442\u0438, \u043A\u0443\u0434\u0430 \u0437\u0430\u043D\u043E\u0441\u044F\u0442\u0441\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0435\
\u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 (\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438, \u0421\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u0438, \u0417\u0430\u043A\u0430\u0437\u044B \u0438 \u0442.\u043F.). \u041F\u043E\u0441\u043B\u0435 \u0432\u044B\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u044F \u0432\u0441\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u0440\u043E\u043F\u0430\u0434\u0430\u044E\u0442.</p>
test=\u0412\u0430\u0441 \u043F\u0440\u0438\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0443\u0441\u043B\u043E\u0432\u043D\u043E-\u0442\u0435\u043E\u0440\u0435\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u0438\u043D\u0442\u0435\u0440\u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u044F Workshop \u043D\u0430 \u0441\u0432\u043E\u0435\u0439 \u0433\u043B\u0430\u0432\u043D\u043E\u0439 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0435.\
\u0422\u0435\u043E\u0440\u0435\u0442\u0438\u0447\u0435\u0441\u043A\u0438, \u043C\u044B \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u043C \u043B\u044E\u0431\u043E\u0439 \u0441\u043F\u0435\u043A\u0442\u0440 \u0443\u0441\u043B\u0443\u0433. \u0421\u0435\u0439\u0447\u0430\u0441 \u043C\u044B \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u043C \u0432\u0430\u043C \u0422\u041E, \u0440\u0435\u043C\u043E\u043D\u0442 \u0438 \u043B\u044E\u0431\u043E\u0435 \u043E\u0431\u0441\u043B\u0443\u0436\u0438\u0432\u0430\u043D\u0438\u0435 \u0432\u0430\u0448\u0435\u0433\u043E \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434\u0430.\
\u0415\u0441\u043B\u0438 \u0432\u044B \u043B\u0438\u0447\u043D\u043E \u043F\u043E\u0441\u0435\u0442\u0438\u043B\u0438 \u043D\u0430\u0448 \u043E\u0444\u0438\u0441, \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043E\u0444\u043E\u0440\u043C\u0438\u0442 \u0434\u043B\u044F \u0432\u0430\u0441 \u0437\u0430\u043A\u0430\u0437 \u0438 \u0432\u044B\u0434\u0430\u0441\u0442 \u0432\u0430\u043C \u0435\u0433\u043E \u043D\u043E\u043C\u0435\u0440, \u0430 \u043D\u0430 \u0441\u0430\u0439\u0442\u0435, \u0431\u0435\u0437 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438, \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043E\u0442\u0441\u043B\u0435\u0434\u0438\u0442\u044C \u0435\u0433\u043E \u0441\u0442\u0435\u043F\u0435\u043D\u044C \u0433\u043E\u0442\u043E\u0432\u043D\u043E\u0441\u0442\u0438.\
\u0415\u0441\u043B\u0438 \u0432\u044B \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0435\u0442\u0435\u0441\u044C, \u0442\u043E \u0441\u043C\u043E\u0436\u0435\u0442\u0435 \u0441\u0430\u043C\u0438 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0437\u0430\u043A\u0430\u0437\u044B, \u0432\u044B\u0431\u0438\u0440\u0430\u044F \u0438\u0437 \u043F\u0440\u0430\u0439\u0441\u0430 \u043D\u0443\u0436\u043D\u044B\u0435 \u043F\u0440\u0435\u0434\u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u0443\u0441\u043B\u0443\u0433\u0438, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u0438\u0432\u0435\u0437\u0442\u0438 \u043A \u043D\u0430\u043C \u0432\u0435\u043B\u043E\u0441\u0438\u043F\u0435\u0434 \u043F\u043E\u0437\u0436\u0435.
html.title.index=\u0413\u041B\u0410\u0412\u041D\u0410\u042F \u0421\u0422\u0420\u0410\u041D\u0418\u0426\u0410 WORKSHOP
html.h1.index=\u0413\u043B\u0430\u0432\u043D\u0430\u044F \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430 Workshop