message.confirmRegistrationFirstTime=To enable your account you need to log into the system for the first time with the help of email and password you used while registeration.
message.confirmRegistrationRequiredDemo(3)=<p>\
\u0412 \u0438\u0434\u0435\u0430\u043B\u044C\u043D\u043E\u043C \u043C\u0438\u0440\u0435 \u043D\u0430 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u0443\u044E \u043F\u0440\u0438 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043F\u043E\u0447\u0442\u0443 ({0}) \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441\u0441\u044B\u043B\u043A\u0430 \u0441 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u043C UUID ({1}), \u043F\u0440\u043E\u0439\u0434\u044F \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u0439, \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0430\u0435\u0442 \u0441\u0432\u043E\u044E \u0434\u0435\u0439\u0441\u0442\u0432\u0443\u044E\u0449\u0443\u044E \u043F\u043E\u0447\u0442\u0443 \u0438, \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u043E, \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044E.\
<br>\
\u041D\u043E \u0434\u043B\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0445 \u0443\u0441\u043B\u043E\u0432\u0438\u0439 \u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0441\u0442\u043E \u043F\u0440\u043E\u0439\u0442\u0438 \u043F\u043E \u0442\u0430\u043A\u043E\u0439 \u0436\u0435 \u0441\u0441\u044B\u043B\u043A\u0435 \u043E\u0442\u0441\u044E\u0434\u0430 \u0438 {2}.\
</p>
message.confirmRegistrationRequired(1)=Dear {0}, to enable your account you need to login for the first time by the link we have sent you by your email.
message.confirmRegistrationSuccess(1)=Dear {0}, you're successfully confirmed your registration and now you can enter the site by using your email and password.
message.jwtTokenExpired=Authentication key expired. Log in again.
message.loginNotValidForRequestedPhoto=The requested photo doesnt match logged User!
message.notFound(1)={0} not found!
message.photoUploadError=Photo upload failed! Please try again.
message.uploadImageSizeExceeded(1)=The maximum upload image file is {0}
message.uuidRegConfirmNotValid=UUID \u043A\u043E\u0434 \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0439! \u041E\u043D \u043B\u0438\u0431\u043E \u043F\u0440\u043E\u0441\u0440\u043E\u0447\u0435\u043D (\u0442.\u0435., \u043D\u0435 \u0431\u044B\u043B \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 24\u0445 \u0447\u0430\u0441\u043E\u0432 \u043F\u043E\u0441\u043B\u0435 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438), \u043B\u0438\u0431\u043E \u043E\u0448\u0438\u0431\u043E\u0447\u043D\u044B\u0439. \u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u043E\u0442\u0435\u0440\u044F\u043B\u0438 \u043F\u0438\u0441\u044C\u043C\u043E \u0441\u043E \u0441\u0441\u044B\u043B\u043A\u043E\u0439 \u0434\u043B\u044F \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438, \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435\u0441\u044C \u043A\u043D\u043E\u043F\u043A\u043E\u0439 "\u0412\u044B\u0441\u043B\u0430\u0442\u044C \u043F\u043E\u0432\u0442\u043E\u0440\u043D\u044B\u0439 \u043A\u043E\u0434 \u0430\u043A\u0442\u0438\u0432\u0430\u0446\u0438\u0438" \u0432 \u0440\u0430\u0437\u0434\u0435\u043B\u0435 "\u0420\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044F". \u0415\u0441\u043B\u0438 \u0436\u0435 \u0432\u044B \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u043B\u0438\u0441\u044C \u0431\u043E\u043B\u044C\u0448\u0435, \u0447\u0435\u043C 24 \u0447\u0430\u0441\u0430 \u043D\u0430\u0437\u0430\u0434, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0441\u0434\u0435\u043B\u0430\u0439\u0442\u0435 \u044D\u0442\u043E \u0435\u0449\u0435 \u0440\u0430\u0437. \u0418 \u043D\u0435 \u0437\u0430\u0431\u0443\u0434\u044C\u0442\u0435 \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0434\u0438\u0442\u044C \u043D\u043E\u0432\u0443\u044E \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044E \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u043F\u043E\u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0445 24\u0445 \u0447\u0430\u0441\u043E\u0432 \u043F\u043E\u0441\u043B\u0435 \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0430.
message.uuidNull=UUID registration confirmation code cannot be null or empty!
message.emailExist(1)=User with email {0} is already exist!
message.emailEnabledExist(1)=The User with {0} email is already exist and active! If it is your email please make a request for password reset on the login page.
message.passwordResetByEmailDemo(3)=<p>\
\u0412 \u0438\u0434\u0435\u0430\u043B\u044C\u043D\u043E\u043C \u043C\u0438\u0440\u0435 \u043D\u0430 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u0443\u044E \u043F\u043E\u0447\u0442\u0443 ({0}) \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441\u0441\u044B\u043B\u043A\u0430 \u0441\u043E \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u043C UUID ({1}), \u043F\u0440\u043E\u0439\u0434\u044F \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u0439, \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u0437\u0430\u0445\u043E\u0434\u0438\u0442 \u043D\u0430 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443 \u0441\u0431\u0440\u043E\u0441\u0430 \u043F\u0430\u0440\u043E\u043B\u044F \u0434\u043B\u044F \u0441\u0432\u043E\u0435\u0433\u043E \u0430\u043A\u043A\u0430\u043D\u0442\u0430.\
<br>\
\u041D\u043E \u0434\u043B\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0445 \u0443\u0441\u043B\u043E\u0432\u0438\u0439 \u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0441\u0442\u043E \u043F\u0440\u043E\u0439\u0442\u0438 \u043F\u043E \u0442\u0430\u043A\u043E\u0439 \u0436\u0435 \u0441\u0441\u044B\u043B\u043A\u0435 \u043E\u0442\u0441\u044E\u0434\u0430 \u0438 {2}.\
</p>
message.uuidPassResetNotValid=UUID \u043A\u043E\u0434 \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0439! \u041E\u043D \u043B\u0438\u0431\u043E \u043F\u0440\u043E\u0441\u0440\u043E\u0447\u0435\u043D (\u0442.\u0435., \u043D\u0435 \u0431\u044B\u043B \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 24\u0445 \u0447\u0430\u0441\u043E\u0432 \u043F\u043E\u0441\u043B\u0435 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438), \u043B\u0438\u0431\u043E \u043E\u0448\u0438\u0431\u043E\u0447\u043D\u044B\u0439. \u0415\u0441\u043B\u0438 \u0432\u044B \u043F\u043E\u0442\u0435\u0440\u044F\u043B\u0438 \u043F\u0438\u0441\u044C\u043C\u043E \u0441\u043E \u0441\u0441\u044B\u043B\u043A\u043E\u0439 \u0434\u043B\u044F \u0441\u0431\u0440\u043E\u0441\u0430 \u043F\u0430\u0440\u043E\u043B\u044F, \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435\u0441\u044C \u043A\u043D\u043E\u043F\u043A\u043E\u0439 "\u0421\u0431\u0440\u043E\u0441\u0438\u0442\u044C \u043F\u0430\u0440\u043E\u043B\u044C" \u0435\u0449\u0435 \u0440\u0430\u0437. \u0415\u0441\u043B\u0438 \u0436\u0435 \u0432\u044B \u0437\u0430\u043F\u0440\u0430\u0448\u0438\u0432\u0430\u043B\u0438 \u0441\u0431\u0440\u043E\u0441 \u0431\u043E\u043B\u044C\u0448\u0435, \u0447\u0435\u043C 24 \u0447\u0430\u0441\u0430 \u043D\u0430\u0437\u0430\u0434, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0441\u0434\u0435\u043B\u0430\u0439\u0442\u0435 \u044D\u0442\u043E \u0435\u0449\u0435 \u0440\u0430\u0437. \u0418 \u043D\u0435 \u0437\u0430\u0431\u0443\u0434\u044C\u0442\u0435 \u0441\u043C\u0435\u043D\u0438\u0442\u044C \u043F\u0430\u0440\u043E\u043B\u044C \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u043F\u043E\u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0445 24\u0445 \u0447\u0430\u0441\u043E\u0432 \u043F\u043E\u0441\u043B\u0435 \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u0441\u0441\u044B\u043B\u043A\u0438.
message.passwordIncorrect=The password must contain at least 5 sybmols without whitespaces!
message.passwordChangedSuccessfully=Password has been changed successfully! Now you can use it for logging in.