message.confirmRegistration=<p>\
\u0414\u043B\u044F \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u044F \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043F\u0440\u043E\u0439\u0434\u0438\u0442\u0435, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u043C\u044B \u0432\u044B\u0441\u043B\u0430\u043B\u0438 \u043D\u0430 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u0443\u044E \u0432\u0430\u043C\u0438 \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u0443\u044E \u043F\u043E\u0447\u0442\u0443.\
</p>
message.confirmRegistration(3)=<p>\
\u0412 \u0438\u0434\u0435\u0430\u043B\u044C\u043D\u043E\u043C \u043C\u0438\u0440\u0435 \u043D\u0430 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u0443\u044E \u043F\u0440\u0438 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043F\u043E\u0447\u0442\u0443 ({0}) \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0441\u0441\u044B\u043B\u043A\u0430 \u0441 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u043C UUID ({1}), \u043F\u0440\u043E\u0439\u0434\u044F \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u0439, \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0430\u0435\u0442 \u0441\u0432\u043E\u044E \u0434\u0435\u0439\u0441\u0442\u0432\u0443\u044E\u0449\u0443\u044E \u043F\u043E\u0447\u0442\u0443 \u0438, \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u043E, \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u044E.\
<br>\
\u041D\u043E \u0434\u043B\u044F \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0445 \u0443\u0441\u043B\u043E\u0432\u0438\u0439 \u043C\u043E\u0436\u043D\u043E \u043F\u0440\u043E\u0441\u0442\u043E \u043F\u0440\u043E\u0439\u0442\u0438 \u043F\u043E \u0442\u0430\u043A\u043E\u0439 \u0436\u0435 \u0441\u0441\u044B\u043B\u043A\u0435 \u043E\u0442\u0441\u044E\u0434\u0430 \u0438 {2}.\
</p>
message.confirmRegistrationNeeded(1)=Dear {0}, to enable your account you need to login for the first time.
message.confirmRegistrationSuccess(1)=Dear {0}, you're successfully confirmed your registration and now you can enter the site by using your email and password.
message.jwtTokenExpired=Authentication key expired. Log in again.
message.loginNotValidForRequestedPhoto=The requested photo doesnt match logged User!
message.notFound(1)={0} not found!
message.PhotoUploadError=Photo upload failed! Please try again.
message.uploadImageSizeExceeded(1)=The maximum upload image file is {0}
message.uuidNotValid=<p>\
The given UUID code is not valid!\
<br>\
It is either outdated (not confirmed within 24 hours) or wrong.\
<br>\
If you have had the registration process more than 24 hours ago please do it again.\
<br>\
And don't forget to confirm your registration within next 24 hours after completion.\
</p>
message.uuidNull=UUID registration confirmation code cannot be null or empty!